[{"contributors": [{"username": "georgeshanti", "email": "georgeshanti@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 1, "createdAt": "2018-10-02T10:11:56.737Z", "updatedAt": "2018-10-16T14:17:31.252Z"}], "active": true, "name": "Third Eye Photography", "codename": "third-eye", "about": "<p>A million things can happen in a moment. From myriad emotions to familiar scents, places and it's people to memories and journeys, a moment is never enough. Photography is the art of weaving a million stories from a single moment. It's never just about what is seen, it's always about how it is seen and experienced. For those who believe that immortality is just a click away, Excel 2018 brings you The 'Third Eye Photography Contest' in the memory of Vineeth Marar.</p> <br><p>Become a storyteller, capture defining moments and share your experience through images. Ignite passions, initiate thought and inspire action through the power of the lens.</p>", "format": "<b>First Phase</b> – Online Contest<br><b>Second Phase</b> – Instant Photography <h3>ONLINE COMPETITION</h3> <p>An online photography contest spanning 4 weeks, wherein participants will need to submit photographs related to the theme provided for that particular time period. Each week will have a different theme, which will be updated on the official Facebook and Instagram page of Excel 2018, for which the participants can submit a maximum of 3 photographs. Entries must be mailed to thirdeye@excelmec.org . The participant can participate in all of the four sessions.</p> <p>All the images received will be uploaded on Excel's Facebook page in an album titled 'Third Eye - Online Photography Entries' with the caption submitted by the participant along with the ID no. provided to each participant. The photos will also be uploaded on Instagram, with the hashtags provided along with the entry.</p> <ul><li>Theme 1: Happiness Amidst The Chaos<br>Deadline : 7th October 2018</li> <li>Theme 2: Streets</li><li>Theme 3: Silhouette</li></ul> <h3>JUDGING CRITERIA</h3> People’s Choice: <ul><li>Facebook Like - 1Pt</li> <li>Facebook Comment - 2Pt</li>  <li>Instagram Like - 2Pt</li> <li>Instagram Comment - 3Pt</li></ul> Judges Choice: <ul><li>Alignment with the theme - 40%</li> <li>Creativity - 30%</li> <li>Photograph Quality - 30%</li></ul> The winners will be announced in the Excel MEC Facebook and Instagram page. <h3>INSTANT PHOTOGRAPHY ROUND</h3> <p>Participants will be given a theme during the days of excel 2018 and will be asked to take photographs based on this given theme. Participants can submit at most 3 photographs based on the particular theme by mailing it to thirdeye@excelmec.org . Photographs are awarded marks based on the content, originality and relevance to the theme.</p>", "rules": "<h3>RULES AND REGULATIONS</h3> <ol><li>All participants should be a undergraduate student.</li> <li>Photography, using all types of cameras (DSLR, SLR, Mobile cameras) is permitted. The type of camera must be mentioned along with each entry.</li> <li>All entries must be submitted in digital format via e-mail. Mails must be sent to thirdeye@excelmec.org.</li> <li>All entries must contain a Short description of the photo and Hashtags, the name of the participant, name of the college/organization/school, phone number and, if possible, the exif details of the photo.</li> <li>All photographs must be in JPEG or JPG format.</li> <li>Each entrant may submit at most 3 photographs for a theme with respective descriptions. Each photo must be less than 8MB in size.</li> <li>Post processing of any kind is explicitly forbidden and is a criterion for disqualification.</li> <li>Watermarks of any kind are NOT allowed. Submitted pictures will be watermarked by the event organisers so as to prevent the misuse of the submitted picture.</li> <li>Submission of plagiarised photos or show of popularity using unfair means will result in the photo being disqualified for the category of People's choice.</li> <li>Presence of any sort of vulgarism, racism or provocation as well as copied entries, if found with valid proof, will be disqualified and deleted from the album immediately.</li> <li>By submitting an entry, each entrant agrees to the official rules and warrants that the entry complies with all the guidelines in the official rules.</li> <li>This is skill-based contest and it plays an important part in the determination of winners.</li> <li>Photos that portray or otherwise include inappropriate and/or offensive content, including provocative nudity, violence, human rights and/or environmental violation, and/or any other contents deemed to be contrary to the law, religious, cultural & moral traditions and practices of India, are strictly prohibited and will be immediately disqualified</li> <li>Submitted photos must be original, created and/or taken by the contestant. It must not contain any materials owned or controlled by a third party for which you have not obtained a license, must not infringe the copyright, trademark, moral rights, rights of privacy/publicity or intellectual property rights of any person or entity.</li> <li>Excel 2018 reserves the right to call for original JPEG or RAW files with unchanged EXIF for the purpose of authentication. An image maybe disregarded if this information cannot be provided.</li> <li>Any use of unfair means to gain likes or share if found by the Excel team will result in immediate disqualification.</li> <li>Rules are subject to change at any point in time.</li></ol> <br> <h3>RELEASE</h3> <p>The winning photograph will be released on Excel 2018 Facebook and Instagram page, at the end of the event.</p> <p>Upon winning, the participant should submit College ID proof along with the original photograph.</p> <p>Odds of winning depend upon the number of eligible entries received and the skill displayed by the entrant.</p> <br> <h3>LICENSE</h3> <p>All entries retain the copyright to their photograph, for the duration of copyright, and may use each photograph and description for advertising, marketing and promotional purpose to any and all media now known or hereafter created.</p>", "contact": "<div><p><b>Tinu Mathew</b></p><p>Event Coordinator</p><p>+91 97467 75597</p></div> <div><p><b>Atul Krishnan</b></p><p>Event Coordinator</p><p>+91 95441 20630</p></div>", "contactInfo": [{"name": "Tinu Mathew", "designation": "Event Coordinator", "phone": "+91 97467 75597"}, {"name": "Atul Krishnan", "designation": "Event Coordinator", "phone": "+91 95441 20630"}], "prize": "15k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Online", "date": "--", "time": "--", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "http://excelmec.org/static/images/third-eye-photography.png", "color": "#2fb454", "id": 1}, {"contributors": [{"username": "georgeshanti", "email": "georgeshanti@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 1, "createdAt": "2018-10-02T10:11:56.737Z", "updatedAt": "2018-10-16T14:17:31.252Z"}], "active": true, "name": "XLR8", "codename": "xlr8", "about": "Control of the mind is the control of your future. What if you could use your robotics and coding skills to prove your coordination and control? And when put to challenge, will you succeed despite pressure? Excel 2018 presents XLR8, the ultimate test to find the best bot wrangler. Invest your time and effort to design the best hand gesture controlled bot that follows your will and understands the world to traverse and explore fully.", "format": "<h3>Rounds</h3> <ol><li><b>Test round:</b> The bot’s capabilities will be checked in this round. Only those that satisfy the given specifications may advance into the next round. The bot will also have to travel a curved path without any external control.</li> <li><b>Time Trial:</b> The bots will have to race against a clock in this round, traversing a path with twists, turns and obstacles to reach the finish line. The top 5 teams with the best times will advance to the next round.</li> <li><b>Block transport:</b> In this round, the bots will have to transport cubic blocks from one point to another in the arena. The team that transports the most number of blocks within the given time wins. If the timer stops midway while transporting the block this distance will also be counted for the final score.</li></ol>", "rules": "<h3>Specifications</h3> <b>Team Specifications:</b> <ol><li>Each team can have a maximum of 3 members.</li> <li>All members are requested to produce a valid ID card of their institution.</li> <li>Cross college teams are permitted.</li> <li>Participation from school students is also encouraged.</li></ol> <b>Bot Specification:</b><br> <p>The maximum dimension allowed for the bot is 20cm X 20cm X 15cm. Also, the bot should be no smaller than 7cm x 6cm x 2cm. The bot may be wireless/wired but its motion must be controlled by the wrist movements of the player. Ready-made microcontroller boards, readymade sensors kits and accelerometers may be used. The bot cannot be made from any readymade assembly kits or lego parts. Power supply/battery packs for the system will not be provided at the venue.</p> <h3>Rules and Regulations</h3> <ol><li>Maximum duration for each round will be given at the venue.</li> <li>The teams are required to complete the track in the minimum time possible.</li> <li>The vehicle should only move through the path specified. If the bot violates the path external control (tugging of the wire, touching the bot etc.) is prohibited. Course corrections must be made in 10 seconds or less.</li> <li>If at any point during the race the vehicle encounters a problem, the participants will be given 2 minutes to go up to the vehicle and fix it.</li> <li>In case of ties, a re-match will be held.</li> <li>The contestants should be ready with the circuit diagrams, algorithms and code (if any) to give proper answers to any questions by the judges.</li> <li>The event managers reserve the right to change any or all of the above rules as they deem fit. Change in rules, if any, will be highlighted on the website and notified to the registered participants.</li></ol>", "contact": "<div><p><b>Arun Kumar</b></p><p>Event Coordinator</p><p>+91 80891 34329</p></div> <div><p><b>Tony Sajan</b></p><p>Event Coordinator</p><p>+91 94005 05763</p></div>", "contactInfo": [{"name": "Arun Kumar", "designation": "Event Coordinator", "phone": "+91 80891 34329"}, {"name": "Tony Sajan", "designation": "Event Coordinator", "phone": "+91 94005 05763"}, {"name": "Srishti Robotics", "designation": "Technical Support", "phone": "+91 79022 24040"}], "prize": "20k", "registration": "Rs. 350/-", "department": "Robotics", "category": "Offline", "date": "4th Nov", "time": "10:00 AM", "venue": "Amphitheatre, MEC", "img": "https://excelmec.org/static/images/robowar.png", "color": "orange", "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSepqJhzcgpY0jVIwDvPY4kjlbE5vGoEDHIx4-zCRUAk3eaInA/viewform?usp=sf_link"}], "id": 2}, {"contributors": [{"username": "georgeshanti", "email": "georgeshanti@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 1, "createdAt": "2018-10-02T10:11:56.737Z", "updatedAt": "2018-10-16T14:17:31.252Z"}], "active": true, "name": "Robosoccer", "codename": "robosoccer", "about": "Football fever is again on the rise. With a thrilling season of ISL coming up, let's all get crazy over robotic football as well. Excel MEC proudly unveils the grandest football tournament:Robosccer.The stadium is all lit up,the spotlights on you.Boot up your bot, and arrive with ambitious swag. Be ready to witness an extravaganza like none other within the comforts of the touchline.", "format": "<h3>ROUND 1:Preliminary</h3> Head to head matches based on registration order.4 teams will be selected to the semifinals based on goal difference.<h3>ROUND 2:Semifinals</h3> The team with maximum number of goals wins. In case of tie, there will be sudden death. Winners will qualify to the finals.<h3>ROUND 3:Grand Finale</h3> The team with maximum number of goals  in the match wins. In case of tie,it will be a sudden death. The winner gets 1st prize and the loser gets 2nd.  <h3>Loser’s Final:</h3> The team with maximum number of goals in match wins. In case of tie,it will be sudden death.The winner gets the 3rd prize.", "rules": "<h3>Round 1: PRELIMINARY ROUND</h3><ol><li>Each team will have to face one other team based on the order of registrations and the top four will move to the semi-finals.</li> <li>The positions will be determined based on the points scored by each team.</li> <li>There won’t be any tie breaker during prelims.</li> <li>In case of odd number of teams,one team will be without an opponent. The opponent will be chosen from a lot. Teams who wish to increase their GD can participate in this lot.The new GD will be the average of the GD from the 2 matches.</li> <li>The top 4 teams will qualify on to the semifinals.</li></ol> POINT DISTRIBUTION: 1 goal – 1 point.<br> MATCH DURATION: 6 minutes. Break of 30 seconds after 3 mins match. <br/> <h3>Round 2: THE SEMI-FINALS</h3><ol><li>The team with maximum number of goals in the match wins.</li> <li>In case of tie, it will be sudden death.</li> <li>The winners of semi-finals will qualify to Grand Finale.</li></ol> MATCH DURATION: 8 minutes. Break of 1 minute after 4 minutes of match. <br/><br/> <b>Loser’s final:</b> <ol><li>The team with maximum number of goals in match wins.</li> <li>In case of tie. It will be sudden death.</li> <li>The winner gets the 3rd prize</li></ol> MATCH DURATION: 8 minutes. Break of 1 minute after 5 minute of match. <br/> <h3>Round 3: THE GRAND FINALE</h3><ol><li>The team with maximum number of goals in match wins.</li> <li>In case of tie. It will be a sudden death.</li> <li>The winner gets 1 st price Loser 2nd.</li></ol> MATCH DURATION: 10 minutes. Break of 1 minute after 5 minute match.<br/> NOTE: POINTS ARE NOT CARRIED TO NEXT LEVEL. Higher points at the end of round do not guarantee any leverage in the next rounds. \f<br/> <h3>BONUS</h3><ol><li>Wireless bot will be given an advantage of 1 extra goal in case of a tie.</li> <li>Any team/team member found disrespecting the rules/ other competitors will be disqualified.</li></ol><br/> <b>Robot Specifications:</b> <ol><li>The dimension of the bot should not exceed 30cm length, 20cm height and 30cm height.</li> <li>The maximum weight of the bot should not exceed 5kgs.</li> <li>The bot must be manually controlled through wired/wireless interface.</li> <li>The length of wire (if wired) should be enough for the bot to travel throughout the stage. The wire should not be in the way of ball or opponent.</li> <li>Actuators that may help in the motion of the bot are allowed.</li> <li>Users of readymade bots are not allowed.</li> <li>Each of bot must have its own power supply not exceeding 12V.</li> <li>Trap for ball should not be in any other shape then rectangle with front side open. The breadth should be less than 5cm. This by whole should fit under the dimensional constrains.</li> <li>Coordinators can change the event format at any time during the event.</li> <li>Decision of the judge shall be final.</li></ol><br/> <b>Arena Specifications:</b><br> <p>The playing field is x cm by y cm. The field is marked by a white line which is part of the playing field. Around the playing field, beyond the white line, is an outer area of 30 cm width. There exterior wall includes a wedge, which is 15 cm rise in order to prevent ball from leaving the playing field. The goal scored by the teams will be displayed in the screen.</p><br/> <b>Rules:</b> <ol><li>One team can have a maximum of 4 members and all members may not be same college.</li> <li>Every participant must have their college ID card/ Excel participation ID.</li> <li>Each team can only use one bot for the match.</li> <li>The team which manages to score the maximum number of goals win. In case of draw. it will be sudden death.</li> <li>The controller should stay behind his/her goal post.</li> <li>The bots will be placed at opposite corners of the stage before start of each session.</li> <li>The game will start at the count of 3 given by refree followed by whistle. In case a team starts its robot before the whistle, the game will be restarted and a team making this mistake for more than 3 times will be disqualified.</li> <li>In case of jam up of robots for more than 30 seconds the robots will have to kick-off again at the order of the refree.</li> <li>All teams will have to have their bots inspected by the coordinators before the commencement of the match.</li></ol>", "contactInfo": [{"name": "Sreehari P B", "designation": "Event Coordinator", "phone": "+91 82898 73323"}, {"name": "Rohit Anilkumar", "designation": "Event Coordinator", "phone": "+91 807755 79736"}], "prize": "15k", "registration": "Rs. 400/-", "department": "Robotics", "category": "Offline", "date": "3rd Nov", "time": "10:00 AM", "venue": "Amphitheatre, MEC", "img": "https://excelmec.org/static/images/robosoccer.png", "color": "#2f9db4", "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSeDpKiUpufiUM3f7Hr5FV1AOzCD3pBsDrtw8_oP_wyChxTl1Q/viewform?usp=sf_link"}], "id": 3}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Defuse", "codename": "defuse", "about": "<b>3..2..1... BOOM! Every second matters in this deadly game!</b> <br> <p>When you are amidst intense turmoil, with the time ticking and your heart pacing DON your skills of Digital Electronics for you are to defuse a live bomb!</p> <p>Rise to the occasion and be the saviour! Hurry!<p>", "format": "<b>EVENT FORMAT</b><br>  <p><b>Round 1: Prelims (30 mins)</b> <br> The teams consisting of 3 members have to face a set of questions which will test their basic knowledge in digital electronics. The top 8 teams selected will advance to the next round.</p> <p><b>Round 2: Debugging (1.5 hour)</b><br>  This round consist of two stages:<p><b>Stage 1:</b><br> The selected eight teams need to crack a password using common logic and basics in electronics. All the teams will move to stage 2 as soon as they complete this level.</p> <b>Stage 2:</b><br> The teams need to debug and correct a digital circuit to find the location of the next task. Only first 5 teams advances to the next level.</p>  <p><b>Round 3: Designing (1.5 hours)</b> <br> Here the teams need to design and implement a digital circuit with the clues they got from the previous stages to find the exact location of the bomb. First 3 teams to successfully finish this task will qualify into the finals. </p> <p><b>Round 4: Final round (1 hour)</b><br>  The finalists need to defuse the bomb before it is too late. The first team to stop the blast will be declared the winner.</p><br><p><b>First prize :</b> merit certificate + 5k<br><b>Second prize:</b> merit certificate + 3k<br><b>Third prize:</b> merit certificate + goodies</p>", "rules": "<b>GENERAL RULES</b> <ol> <li>This will be a team event with each team having not more than 3 members.</li> <li>Inter college teams are allowed.</li> <li>All members are expected to exhibit their college ID and Excel ID cards.</li> <li>Use of internet is strictly prohibited.</li> <li>All items required for the event will be provided by the coordinators.</li> <li>Decision of the coordinators will be final.</li> <li>Excel team will not bear responsibility for any loss of property, injury or delay caused by participants during the event. </li> <li>Teams violating the above rules will be suspended immediately.</li> <li>Malpractices and sabotaging other team’s machines will lead to immediate disqualification.</li> <li>Participants are not to damage any of the college property or equipment, if found so are liable to be fined.</li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li> <li>Rules are subjected to change at any point of time and it will be explained at the event as well.</li> </ol>", "contact": "<div><p><b>Ferdinand Thomas</b></p><p>Event Coordinator</p><p>+91 97462 96524</p></div> <div><p><b>Nandhini Udayan</b></p><p>Event Coordinator</p><p>+91 82813 85129</p></div>", "contactInfo": [{"name": "Ferdinand Thomas", "designation": "Event Coordinator", "phone": "+91 97462 96524"}, {"name": "Nandhini Udayan", "designation": "Event Coordinator", "phone": "+91 82813 85129"}], "prize": "8k", "registration": "No Additional Fee", "department": "Electronics", "category": "Offline", "date": "03rd Nov", "time": "9:30 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/defuse-101.png", "color": "bisque", "id": 4, "buttons": [{"name": "Register", "link": "https://goo.gl/forms/RRbXQXNhhcovHbkx2"}]}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Elecquest", "codename": "elecquest", "about": "<b>Are you game for the most epic evening of brainstorming?</b><br><p> Brace yourselves as you embark on a journey through a sea of clues and puzzles in <b>Elequest<b>, the quest of ultimate knowledge and power. Gather all your electrical and electronic gusto, and try hard to hit the jackpot. For you're not going to regret the treasure at the end of this rainbow.</p>", "format": "<b>Round 1 (Prelims):</b> <p>The participants will have to face a set of questions based on electrical and electronics concepts. Top 7 teams will advance to the next round.</p><br><b>Round 2 (Debugging):</b> <p>Each team will be given a circuit to work with.The given circuit has to be corrected so as to obtain the desired output. The teams will be scored on the basis of how fast they can obtain the output. First 5 teams to correctly debug the given circuit will advance to the next round.</p><br><b>Round 3:</b> <p><b>Task 1:</b><br> <b>Technical Crossword Puzzle</b><br>Each team will be given a crossword. Teams will be ranked on the basis of number of words completed, with more points given to those who complete the maximum words.<br><b>Task 2:</b><br> <b>Signal Synthesis</b><br>Teams will be given a continuous function to be synthesized. Teams will have to design a circuit to obtain the output waveform. The top 3 teams from Round 3 will advance to the next round.</p><br><b>Round 4</b>: <br><b>The Quest</b><p>The teams shortlisted will have to collect clues that are spread all over the campus and have to complete the final task based on the clues collected. The first team to complete the task will be declared the winner.</p><br><p><b>1st Prize:</b> Merit Certificate + 5K Prize Money<br><b>2nd Prize:</b> Merit Certificate + 3K Prize Money<br><b>3rd Prize:</b> Merit Certificate + Voucher/Goodies</p>", "rules": "<ol> <li>A team of 3 is required.</li> <li>The decision of the organizers will be final.</li> <li>Rules are subject to change at any point of time. Participants will be duly notified of any change.</li> <li>Cross college teams are allowed.</li> <li>Contestants should present their college ID cards.</li> <li>Any team not abiding by the rules of the event will be immediately disqualified.</li> <li>A basic knowledge on digital electronics  will be an advantage.</li> <li>Judges' decision will be final.</li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li> </ol>", "contact": "<div><p><b>Levin Jose</b></p><p>Event Coordinator</p><p>+91 82816 07482</p></div> <div><p><b>Ajith M.A</b></p><p>Event Coordinator</p><p>+91 94957 57027</p></div>", "contactInfo": [{"name": "Levin Jose", "designation": "Event Coordinator", "phone": "+91 82816 07482"}, {"name": "Ajith M.A", "designation": "Event Coordinator", "phone": "+91 94957 57027"}], "prize": "8k", "registration": "No Additional Fee", "department": "Electronics", "category": "Offline", "date": "03rd Nov", "time": "10:30 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/elecquest.png", "color": "khaki", "id": 5, "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/18CV3GxweFnHYqXubA0kmUMrYPRwVQlOL0UiQRHVK27E/edit"}]}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Extrinsicity", "codename": "extrinsicity", "about": "<p>Arriving at an answer, may it be a design or a mathematical solution, is pure bliss.<br>Are you from the jolly lot that loves meddling with circuits and fraternising with signals?<br>Then look no further <b>Excel 2018</b> presents <b>Extrinsicity</b>, an event that'll get you untangling errors and designing circuits like crazy.<br><b> Register Today...</b><p>", "format": "<b>Round 1: prelims (30mins)</b>   <p>The contestants will be tested in the field of basic electronic circuits. This will be a screening stage to sieve out the electronic masterminds and they will advance to next round. The top 10 teams qualify to round 2.</p><br><b>Round 2: circuit marathon (30mins)</b> <p>The top ten teams from the prelims stage will take part in this. In this stage the designing and problem solving skills of the teams are tested. The first 6 teams to answer all the questions qualify to the next stage.</p><br><b>Round 3: wave cloning (1.5hours)</b> <p>The shortlisted teams will have to replicate a given pattern on the CRO/DSO. The first 3 teams to complete the task with the most perfect output will qualify to the final round.</p><br><b>Round 4: debugging (1.5 hours)</b> <p>The shortlisted teams will have to identify and debug the given analog circuit to get the desired output within the stipulated time. The team which is fastest to do this task with the maximum score will be declared the winner.</p><br><p><b>Prize </b><br>First prize : merit certificate + 5k<br>Second prize : merit certificate + 3k<br>Third prize : merit certificate + goodies</p>", "rules": "<b>GENERAL RULES<b><br> <ol> <li>This will be a team event with each team having not more than 4 members.</li> <li>Inter college teams are allowed.</li> <li>All members are expected to exhibit their college ID and Excel ID cards.</li> <li>Use of mobile phones are strictly prohibited.</li> <li>All items required for the event will be provided by the coordinators.</li> <li>Decision of the coordinators will be final.</li> <li>Excel team will not bear responsibility for any loss of property, injury or delay caused by participants during the event. </li> <li>Teams violating the above rules will be suspended immediately.</li> <li>Malpractices and sabotaging other teams' machines will lead to immediate disqualification.</li> <li>Participants are not to damage any of the college property or equipment, if found so are liable to be fined.</li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li> <li>Rules are subjected to change at any point of time and it will be explained at the event as well.</li> </ol>", "contact": "<div><p><b>Anjana A N</b></p><p>Event Coordinator</p><p>+91 81292 99175</p></div> <div><p><b>Jayakrishnan T N </b></p><p>Event Coordinator</p><p>+91 82817 58675</p></div>", "contactInfo": [{"name": "Anjana A N", "designation": "Event Coordinator", "phone": "+91 81292 99175"}, {"name": "Jayakrishnan T N ", "designation": "Event Coordinator", "phone": "+91 82817 58675"}], "prize": "8k", "registration": "No Additional Fee", "department": "Electronics", "category": "Offline", "date": "02nd Nov", "time": "9:45 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/extrinsicity.png", "color": "indigo", "id": 6, "buttons": [{"name": "Register", "link": "https://goo.gl/forms/2UMxqpzjeUhY7o6m2"}]}, {"message": "No competition found with the specified `id`."}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Lifeline", "codename": "lifeline", "about": "<i>You don't have to be a doctor or a superhero to save lives.</i><p>Excel 2018's Lifeline is all that you need.<br> In this intriguing game, display your analogue circuit debugging prowess and muster your marketing skills to save your patient's life.</p>  <p>Analyse! Debug! Market it!<br> What's in it for you?<br> Winners get to take part in an <b>Internship opportunity with Stasis labs.</b><br> At the end of day there's only one motive: <i>Vive la patient</i>.</p>", "format": "<p>Lifeline is a medical electronics debugging event.The various rounds test the knowledge of participants in basic electronics and biology, design of electronic circuits and their marketing skills.</p><br><b>Event Format</b><br><b>Round 1: Prelims (30mins)</b><br><i>[11.00 am to 12.00 pm]</i> <ul> <li>The preliminary round consists of  50 questions.</li> <li>The time allotted will be 30 minutes. </li> <li>The contestants will be tested in the field of basic electronics,computer science and basic medical science.</li>  <li>There is no negative marking for incorrect answers. This level will act as a filtration to the coming round. </li> <li>4 teams will be advancing to the second round depending upon the marks scored.</li></ul><br><p>(break for correction till 11.30am)<br></p><br> <b>Round 2: Managerial Round</b><br>  <i>(1 hour 15 minutes)</i>  [12.30 am to 1.45pm] <ul> <li>Expected number of participants: 4*3=12</li> <li>Each team is given a medical equipment.They are given a specified time to study about the equipment and then they have to sell it. In this stage the marketing skills of the teams are tested.</li> <li>The duration of the event is 1 hour and 15 minutes.</li> <li>The first 15 minutes is given for preparation.</li> <li>The teams are given the user-manual of the specified equipment for preparation.</li> <li>The presentation is made based on the technical specifications, features of the equipment, its user domain, working principles and procedures for its use.</li> <li>The participants are allowed to use the Internet.</li> <li>The maximum time for presentation is 15 minutes for each team.</li> <li>3 teams will be shortlisted for the third round.</li> </ul><p>( Break for correction: 15mins )<br>Event resumes after 30 mins(Lunch Break)</p><br><b>Round 3:</b><br>(1 hour 45 minutes)   [2.30 pm to 3.45pm]  <p>Each team is given two tasks.<br><b><i>Wave Cloning:</i></b><br>The provided wave pattern must be simulated using Proteus. Each team will be provided with laptops. Duration for this round would be 45 minutes. After 45 minutes each team would be automatically advancing to next level even if they have not completed the previous round.<br><b><i>Circuit Implementation:</i></b><br> each team has to setup the circuit required for the given problem statement. Breadboard and the necessary components will be provided.The total time duration is 1 hour. </p><br><p><b>1st prize :</b> merit certificate + 5k prize money + Internship offer from Stasis Labs<br><b>2nd prize :</b> merit certificate + 3k prize money<br><b>3rd prize :</b> merit certificate + voucher/goodies</p>", "rules": "<b>GENERAL RULES</b><br> <ol> <li>This will be a team event with each team having not more than 3 members.</li> <li>Inter college teams are allowed.</li> <li>All members are required to exhibit their college ID and Excel ID cards.</li> <li>Use of mobile phones are strictly prohibited.</li> <li>All items required for the event will be provided by the coordinators.</li> <li>Decision of the coordinators will be final.</li> <li>Excel team will not bear responsibility for any loss of property, injury or delay caused by participants during the event. </li> <li>Teams violating the above rules will be suspended immediately.</li> <li>Malpractices and sabotaging other teams' machines will lead to immediate disqualification.</li> <li>Participants are not to damage any of the college property or equipment and if found so are liable to be fined.</li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li> <li>Rules are subject to change at any point of time and it will be explained at the event as well.</li> </ol>", "contact": "<div><p><b>Pranoy SP </b></p><p>Event Coordinator</p><p>+91 82816 83877</p></div> <div><p><b>Amrutha S Kumar</b></p><p>Event Coordinator</p><p>+91 99955 27958</p></div>", "contactInfo": [{"name": "Pranoy SP ", "designation": "Event Coordinator", "phone": "+91 82816 83877"}, {"name": "Amrutha S Kumar", "designation": "Event Coordinator", "phone": "+91 99955 27958"}], "prize": "8k", "registration": "No Additional Cost", "department": "Electronics", "category": "Offline", "date": "02nd Nov", "time": "10:45AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/lifeline.png", "color": "rgb(47, 180, 84)", "id": 8, "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSdm5wif6mvo4BlSLLAcpvk1YlVbMxxY2sGSzHQaq9DLRhggmQ/viewform?usp=sf_link"}]}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Lumiere", "codename": "lumiere", "about": "<p>Have you ever felt the need for an opportunity to be able to apply basic wiring skills in a practical situation? Lumiere will provide you with such a platform. The challenge of Lumiere is to come up with efficient solutions for a given wiring problem and all this while the '<i>clock is ticking</i>'.<br>The event <b>LUMIERE</b> will scrutinize the Ohm, Farad and Henry within you & will hallmark you as the wizard of wiring, if you emerge as the winner.<br>Are you up for this shocking experience? </p>", "format": "<b>Round 1: Prelims</b> <p>The participants will have to answer a set of questions based on electrical engineering concepts. Top 8 teams will advance to the next round.</p><br><b>Round 2: The Big Picture</b> <p>The shortlisted teams will be given a set of pictures/clues using which they have to deduce the answer related to the pictures. Top 5 teams will advance to the next round.</p><br><b>Round 3: Design</b> <p>The shortlisted teams will have to design an electrical wiring diagram from the given problem. The first 3 teams to design the circuit will advance to the next round.</p><br><b>Round 4: Wiring</b> <p>The teams will have to wire the circuit designed by them in the previous round. The team that wires the correct circuit first will be declared the winner.</p><br><p><b>1st Prize:</b> Merit Certificate + 5K Prize Money<br><b>2nd Prize:</b> Merit Certificate + 3K Prize Money<br><b>3rd Prize:</b> Merit Certificate + Voucher/Goodies</p>", "rules": "<b>GENERAL RULES</b><br> <ol> <li>It is a Team event with 3 members per team. </li> <li>Cross college teams are allowed. </li> <li>All participants must have an EXCEL ID. Separate registration is not required for this event. </li> <li>The event comprises of 4 rounds. </li> <li>Excel team reserves the right to take final decisions in case of any dispute. </li> <li>Contestants should present their college ID cards. </li> <li>Malpractices and sabotaging other teams' circuits will lead to immediate disqualification. </li> <li>Judges' decision will be final. </li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues. </li> </ol>", "contact": "<div><p><b>ADARSH A</b></p><p>Event Coordinator</p><p>+91 94976 90059  </p></div> <div><p><b>NAVEEN ANTONY</b></p><p>Event Coordinator</p><p>+91 97454 02295 </p></div>", "contactInfo": [{"name": "ADARSH A ", "designation": "Event Coordinator", "phone": "+91 94976 90059  "}, {"name": "NAVEEN ANTONY", "designation": "Event Coordinator", "phone": "+91 97454 02295 "}], "prize": "8k", "registration": "No Additional Fee", "department": "Electronics", "category": "Offline", "date": "02nd Nov", "time": "9:45AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "http://excelmec.org/static/images/lumiere.png", "color": "orange", "id": 9, "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSfauFoCJJAymR2chdlTNp2Zoi-RHTwKTbaqzdEC3M5xpKhgyg/viewform?usp=sf_link"}]}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Papyrus Of Ani", "codename": "papyrus -of-ani", "about": "<p>Do you have a refreshing idea that can transform the world?<br>Are you bubbling with excitement to prove yourself?<br>For all eager minds bursting with ideas,<b>Excel 2018</b> brings you <b>Papyrus Of Ani</b> - the paper presentation competition to give wings to your ideas.<br> \tDevelop your ideas from inception to fruition. Share your vision with the world by presenting a paper before a panel, during the days of Excel 2018.</p>", "format": "<p><b>First Phase -</b> Abstract Submission</p> <p><b>Second Phase –</b> Paper presentation</p><br> <b>Online Competition</b> <p>\tA paper presentation contest, wherein participants will have to submit abstracts for first phase and present the paper in second phase. Participants have to submit an abstract on their work for Phase 1. Shortlisted candidates have to present their paper before a panel on the days of Excel. Winning teams share a prize pool of 10k.</p>", "rules": "<b>Team Formation:</b> <ol> <li>Each team can have a maximum of 3 members.</li> <li>It is not necessary that the participants forming a team should be from the same college.</li> <li>A participant cannot be part of more than one team.</li> </ol><br> <b>General Rules:</b> <ol> <li>The work should be original and in the requested format.</li> <li>Each team will be given 15 minutes to present their paper.</li> <li>This will be followed by a round of questions from the judging panel or the audience.</li> </ol>", "contact": "<div><p><b>Krishnendu E </b></p><p>Event Coordinator</p><p>+91 94974 87746</p></div><div><p><b>Arun Jayaprakash</b></p><p>Event Coordinator</p><p>+91 94009 00599</p></div>", "contactInfo": [{"name": "Krishnendu E ", "designation": "Event Coordinator", "phone": "+91 94974 87746"}, {"name": "Arun Jayaprakash", "designation": "Event Coordinator", "phone": "+91 94009 00599"}], "prize": "10k", "registration": "No Additional Fee", "department": "Others", "category": "Offline", "date": "02nd Nov", "time": "10:00AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "http://excelmec.org/static/images/papyrus-of-ani.png", "color": "rgb(47, 157, 180)", "id": 10}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Reverso", "codename": "reverso", "about": "<p>The ability to simply design a circuit does not mean that you are excellent. It depends on your capability to turn damaged resources into viable products. Making e-waste useful and making the earth a better place to live in, is what makes you a real engineer.<br><br>This event is about analysing, debugging and reconstructing innovative products from mind boggling circuits! <br>This event will test your knowledge in electronic parts of products used in our daily lives and your ability to design and reuse an existing product so as to form new ones.<br>Are you ready for this!!!!!</p>", "format": "<p>The event will be a team event, with each team having 3 or 4 members. It will be conducted over 3 rounds.</p> <p><b>First Phase:</b> Preliminary test</p> <p><b>Second Phase:</b><br>Phase 1 - List out functionalities<br>Phase 2 - Debugging circuits</p> <p><b>Third Phase:</b> Reverse engineering</p><br><b>Round 1</b> <p>Contestants will be tested in the field of Arduino and some common microcontrollers. The top four will progress to the next phase.</p><br><b>Round 2</b> <p>Phase 1:<br> Participants will be given a household product and asked to list out its functionalities.<br> Phase 2:<br> Participants will be required to debug within the stipulated time.<br> The best 2 teams will be selected based on their analysing and debugging talent.</p><br><b>Round 3:</b> <p>The top 2 teams of phase 2 entering into the final round will have to model ,design and implement a new innovative product from the given existing product.</p>", "rules": "<b>GENERAL RULES</b> <ol> <li>All participants should be school students.</li> <li>Participants need to have basic arduino programming skills.</li> <li>Components including Arduino will be given at the venue. No extra components are to be brought by the participants.</li> <li>All members of the team need not be from the same school.</li> <li>All members are expected to carry their school ID and Excel ID cards with them.</li> <li>Excel team will not bear responsibility for any loss of property, injury or delay caused by participants during the event.</li> <li>Use of mobile phones is strictly prohibited.</li> <li>Teams violating the above rules will be suspended immediately.</li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li> </ol> <p>Rules are subject to change at any point in time. Final decision will be made by the event team.</p>", "contact": "<div><p><b>David J Chazhoor</b></p><p>Event Coordinator</p><p>+91 70126 57761</p></div><div><p><b>Aysha Thankayathil</b></p><p>Event Coordinator</p><p>+91 85920 16441</p></div>", "contactInfo": [{"name": "David J Chazhoor", "designation": "Event Coordinator", "phone": "+91 70126 57761"}, {"name": "Aysha Thankayathil", "designation": "Event Coordinator", "phone": "+91 85920 16441"}], "prize": "8k", "registration": "No Additional Fee", "department": "Others", "category": "Offline", "date": "04th Nov", "time": "10:00 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/uploads/images/reverso.png", "color": "bisque", "id": 11, "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSexiMmxdpPJ-a30E2T4TRlZd2GWeUMSApdVgZQY49y5hYKhrQ/viewform"}]}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Alohomora", "codename": "alohomora", "about": "<p>Alohomora! The magic words have been said. The doors have opened. It’s time to hunt for treasure. The most participated non-tech event in Excel, the event saw more than 300 participants last year. This year, it’s back with greater energy and vigour. This time Alohomora is in both AR and VR.<br>We're pleased to welcome you to be a part of Alohomora, a two-day treasure hunt that spans across the heart of Kerala. Come join us on the 2nd and 3rd of November 2018, to \"<i> Unravel The Mystery</i>\" and be a swashbuckling adventurer!</p>", "format": "<b>Round 1: Written Prelims (Day 1)</b><p><ul><li>There will be no negative marking.</li><li>Usage of mobile phones will lead to instant disqualification.</li><li>The top 6 teams will be selected to the next round.</li></ul></p> <br><b>Second round: Mini hunt covering 3 km area (day 1)</b><p><ul><li>The last two teams to finish will be eliminated.</li><li>There will be clues given to each team and solve the clues to find the next destination.</li><li>Any kind of malpractice will lead to immediate disqualification.</li></ul></p> <br><b>Third round: Treasure Hunt Covering A Larger Area (Day 2)</b><p><ul><li>The first two teams to finish the third round will compete to the key to the treasure.</li><li>There will be clues given to each team and solve the clues to find the next destination.</li><li>Any kind of malpractice will lead to immediate disqualification.</li></ul></p>", "rules": "<b>GENERAL RULES</b><br> <ol><li>Each team <b>must</b> comprise of 4 members.</li><br><li>The participants must carry their <b>valid id cards</b> at each round of the game.</li><br><li>Teams clearing the 1st round should report at the place announced before the <b>time deadline</b>. Failing to report at the specified time will be considered a disqualification.</li><br><li>Picking up fights with other teams or the authority will lead to disqualification of the team.</li><br><li>Since the event is scheduled for two days the participants clearing the first day must look after the arrangements for their accomodation on their own.</li><br><li>Each round has its own set of rules and participants are strictly adviced to stick to those rules and instructions.</li><br><li>Any malpractice during the event will lead to disqualification of the team.</li><br><li>The decision of the authority on any matter will be final.</li></ol>", "contact": "<div><p><b>Shalbin K Shaji</b></p><p>Event Coordinator</p><p>+91 8301859353  </p></div> <div><p><b>Rahul Raj</b></p><p>Event Coordinator</p><p>++91 9847128825 </p></div>", "contactInfo": [{"name": "Shalbin K Shaji ", "designation": "Event Coordinator", "phone": "+91 8301859353  "}, {"name": "Rahul Raj", "designation": "Event Coordinator", "phone": "+91 9847128825 "}], "prize": "15k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "02nd - 3rd Nov", "time": "11:45 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/alohomora.png", "color": "grey", "id": 12}, {"message": "No competition found with the specified `id`."}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Best Manager", "codename": "best-manager", "about": "<i>To be able to lead others, a man must be willing to go forward alone</i> <p>- Harry Truman</p>  <p>A good manager sees the big picture even in the most trivial of circumstances. They are the ones leading from the front, inspiring everyone with their commitment, passion, empathy, and  integrity. A good leader is someone who understands their role; to empower people, help them develop their strengths, and reach their goals with their admirable influence.</p>  <p>If you see yourselves being all that, and much more, be a part of Excel 2018’s BEST MANAGER event, to discover the real manager in you!</p>", "format": "<b>Best Manager is a day-long event that comprises of 3 rounds</b><br>  <b>Round 1</b> <p>This is a written round wherein the business acumen and general knowledge of the candidates are tested.</p>  <b>Round 2</b> <p>This round consists of a business case study. A detailed case is provided to the contestants who then have to come up with ways to tackle the current problems that the virtual company is facing, and bring out solutions.</p>  <b>Round 3</b> <p>This round consist of a Product Launch and Mock Press round. <ul> <li>Participants are given a topic to present their ideas and creative thoughts followed by a questionnaire session.</li> <li>A random case scenario is given to each participant for which they will have to face a mock press conference for.</li> </ul> </p>", "rules": "<b>Rules and Regulations</b> <ol> <li>All participants should be undergraduate students.</li> <li>Individual participation only.</li> <li>Improper behaviour of any means at any stage will lead to immediate disqualification.</li> <li>The decision of the organizers and the judges will be final.</li> <li>Rules are subject to change at any point in time.</li> <li>Participants will be duly notified of any change.</li> </ol>", "contact": "<div><p><b>Karen Ann Jijo</b></p><p>Event Coordinator</p><p>+91 85479 00400  </p></div> <div><p><b>Archana Pradeep</b></p><p>Event Coordinator</p><p>+91 98474 23025 </p></div>", "contactInfo": [{"name": "Karen Ann Jijo ", "designation": "Event Coordinator", "phone": "+91 85479 00400 "}, {"name": "Archana Pradeep", "designation": "Event Coordinator", "phone": "+91 98474 23025 "}], "prize": "8k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "03rd Nov", "time": "11:30 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/best-manager.png", "color": "blue", "id": 14}, {"message": "No competition found with the specified `id`."}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Excelsior", "codename": "excelsior", "about": "<p>Do you have the mettle and grit to go head-to-head with the very best quizzers? Is the thrill and tension of a quiz your idea of a day well spent?</p><br><p>If so, take up arms for Excelsior, where the elite of the elites go to war, armed by their wit and fortified by their knowledge! Join us for an engaging and energetic quizzing experience.</p>", "format": "<b>Round 1 - Written Preliminary Round</b><br><p><ul><li>20 questions</li><li>Starred questions will be considered in case of a tie</li><li>Top six teams from the preliminary round qualify for the finals</li></ul></p><br><br><b>Finals - </b><br><p><ul><li>The quiz will be a general quiz</li><li>The finals would follow a normal infinite bounce and pounce system</li></ul></p>", "rules": "<ol><li>General Quiz</li><br><li>All participants must be enrolled in a university or school</li><br><li>A valid Identity card must be produced at the time of registration</li><br><li>Cross-college/school teams are allowed</li><br><li>Each team would consist of two members</li><br><li>The decision of the quiz master and organisers shall be final</li></ol>", "contact": "<div><p><b>Akhilesh Balakrishnan</b></p><p>Event Coordinator</p><p>8943368362  </p></div> <div><p><b>Ajay Kumar A</b></p><p>Event Coordinator</p><p>9446913086 </p></div>", "contactInfo": [{"name": "Akhilesh Balakrishnan ", "designation": "Event Coordinator", "phone": "8943368362  "}, {"name": "Ajay Kumar A", "designation": "Event Coordinator", "phone": "9446913086 "}], "prize": "10K", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "02nd Nov", "time": "1:00 PM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/excelsior.png", "color": "orange", "id": 16}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "DeFacto", "codename": "defacto", "about": "<p>Quizzing as a sport hinges on one's ability to quickly connect the dots and double down on chances. Experience is rarely ever a factor.</p><br><p>If you believe that being a school student is an asset, that quizzing is your gift and that you can teach us time and again that age is just a number, DeFacto is the quiz for you.</p>", "format": "<b>Round 1 - Written Preliminary Round</b><br><p><ul><li>20 questions</li><li>Starred questions will be considered in case of a tie</li><li>Top six teams from the preliminary round qualify for the finals</li></ul></p><br><br><b>Finals -</b><br><p><ul><li>The quiz will be a general quiz</li><li>The finals would follow a normal infinite bounce and pounce system</li></ul></p>", "rules": "<ol><li>General Quiz</li><br><li>All participants must be enrolled in a school</li><br><li>A valid Identity card must be produced at the time of registration</li><br><li>Cross-school teams are allowed</li><br><li>Each team would consist of two members</li><br><li>The decision of the quiz master and organisers shall be final</li></ol>", "contact": "<div><p><b>Akhilesh Balakrishnan</b></p><p>Event Coordinator</p><p>8943368362  </p></div> <div><p><b>Ajay Kumar A</b></p><p>Event Coordinator</p><p>9446913086 </p></div>", "contactInfo": [{"name": "Akhilesh Balakrishnan ", "designation": "Event Coordinator", "phone": "8943368362  "}, {"name": "Ajay Kumar A", "designation": "Event Coordinator", "phone": "9446913086 "}], "prize": "6k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "04th Nov", "time": "10:00 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/defacto.png", "color": "pink", "id": 17}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Robowar", "codename": "robowar", "about": "<p>Hear! Hear! Hear!<br> Friends, Robots, Countrymen!<br> Excel 2018 is proud to present the most awaited ferocious fight of the year; the very audacious, irrefutably deadly ROBOWARS!!</br> Assemble your team, build a bot. Bring your valiant gladiator to the big league. Hold onto your emotions, let the metal speak as your robots fight it out for the ultimate glory!</p>", "format": "<p><b>Round 1:</b> Preliminary round</p> <p><b>Round 2:</b> Semi-Finals</p> <p><b>Round 3:</b> Final</p><br><b>Round 1:</b><p>Robots will be divided into two groups. Each robot will have to face every member of its own group and the top four will move to the semi-finals.<br> Points are awarded based on the following fields - speed, skill, controlling ability, and strength.<br> Each bot will have to travel through an inclined surface in order to reach the battlefield. The bot which reaches the centre line first will receive bonus points.<br> If any bot remains tangled in the hurdles for more than the allotted time, the opponent will be rewarded points.</p> <p><b>Match Duration -</b> 5 minutes</p>  <b>Point Distribution:</b><br> <p>Distribution of bonus points will only be announced one hour prior to the event.</p>  <ul> <li>Immobilize: Score 10 Points for immobilising opponent for 10 seconds.</li> <li>Flip the Ring: Score 20 Points by flipping opponent robot out of the ring. </li> <li>Pit-Fall : score 30 Points by maneuvering opponent robot into the Pit inside the arena.</li> </ul><b>Round 2:</b> <ul> <li>The arena will have undergone some changes. </li> <li>One-on-One Knockout. </li> <li>There will be two semi-finals. </li> <li>The winners of the two semi-finals will qualify to the Grand Finale. </li> </ul> <p><b>Match Duration -</b> 10 minutes</p>  <b>Point Distribution:</b><br> <ul> <li>Immobilize: Score 10 Points for immobilising opponent for 10 seconds. </li> <li>Flip the Ring: Score 20 Points by flipping opponent robot out of the ring. </li> <li>Pit-Fall: score 30 Points by maneuvering opponent robot into the Pit inside the arena.</li> </ul>  <b>Round 2:</b><br>  <b>The Grand finale<b>  <ul> <li>One-on-one knockout round. </li> <li>10 minute battle. </li> <li>The bot with the maximum points will win.</li> </ul> <b>Point Distribution:</b><br> <ul> <li>Immobilize: Score 10 Points for immobilising opponent for 10 seconds. </li> <li>Flip the Ring: Score 20 Points by flipping opponent robot out of the ring. </li> <li>Pit-Fall: score 30 Points by maneuvering opponent robot into the Pit inside the arena.</li> </ul>     <b>ROBOT SPECIFICATIONS:</b><br> <ul> <li>Maximum permitted dimensions of the robot are 45 cm X 45cm X 45 cm and its weight must not exceed 23 kg. 10% tolerance in weight and dimensions are allowed.</li> <li>Each robot must have its own power supply not exceeding 24V.</li> </ul>", "rules": "<b>GENERAL RULES</b> <ol> <li>Each team can have up to four members.</li> <li>Every participant must have their college ID card/Excel participation ID.</li> <li>Registrations close at 10.00 am on the day of the event.</li> <li>It is not mandatory for all the members of a team to be from the same institution.</li> <li>The robot must be manually controlled through wired/wireless interface.</li> <li>Maximum permitted dimensions of the robot are 45 cm X 45 cm X 45 cm and its weight must not exceed 23 kg. 10% tolerance in weight and dimensions are allowed.</li> <li>Each robot must have its own power supply not exceeding 24V. However a power point(230V AC) will be provided for recharging batteries or to power your supply.</li> <li>Bots can have any form of weapons (other than fire, sharp objects, and projectiles). If any bot is found unsafe for the audience, it'll not be allowed to participate in the event.</li> <li>All teams should have their bots inspected by the coordinators both before and after each stage.</li> <li>Teams are permitted to make minor changes to the body of their robot after every stage if they wish; but modifying the entire body of the robot will not be permitted.</li> <li>Arena will be disclosed only at the time of the event.</li> <li>Coordinators can make changes to the arena at any point of time.</li> <li>Only two members from each team are allowed to operate the bot during each stage.</li> <li>Both members are allowed to control the bot staying behind the board. So the wire must be of sufficient length in order to cover the entire arena.</li> <li>Any team/team member found disrespecting the rules/other competitors, will be disqualified.</li> <li>Bonus points will be announced one hour prior to the event.</li> <li>Coordinators can change the event format at any time during the event.</li> <li>The decision of the judges will be final and binding.</li> <li>Malpractices and sabotaging other teams' machines will lead to immediate disqualification.</li> <li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li> </ol>", "contact": "<div><p><b>Akshai Krishna</b></p><p>Event Coordinator</p><p>+91 95392 95709</p></div><div><p><b>Joel Jacob</b></p><p>Event Coordinator</p><p>+91 89432 60598</p></div>", "contactInfo": [{"name": "Akshai Krishna", "designation": "Event Coordinator", "phone": "+91 95392 95709"}, {"name": "Joel Jacob", "designation": "Event Coordinator", "phone": "+91 89432 60598"}], "prize": "22k", "registration": "Rs. 500/-", "department": "Robotics", "category": "Offline", "date": "02nd Nov", "time": "10 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/uploads/images/Logo_robowar.png", "color": "red", "buttons": [{"name": "Register", "link": "https://goo.gl/forms/SljdO3JXl31R9m802"}], "id": 18}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Reverse Coding", "codename": "reverse-coding", "about": "<p>You might be good at solving challenges that come your way. But what happens when you've the answer and not the problem?<br> Find out in this unique event where your coding skill is put to test as you bridge the given input and output to emerge victorious.</p>", "format": "<p><b>First Phase -</b> Prelims - to be conducted in classrooms.</p> <p><b>Second Phase - Finals - to be conducted in the CC lab.</p>  <b>Preliminary Round</b> <ul> <li>The participants will be given a test that includes 50 MCQ questions. </li> <li>The questions will be based on pattern finding, such as - next number/alphabet in a series, word mixing questions and some output based questions in C/C++ to test their programming abilities.</li> <li>The top 15 teams will be selected for the finals based on their performance in this round.</li> </ul>  <b>Final Round</b> <ul> <li>The selected teams will be given 10 C++ executables files (.o files), which they can execute on Linux systems. When executed, each program will display a clue statement and then prompt for inputs. The participant can input strings/numbers to get an output.</li> <li>After any number of input tries, they have to analyze the logic behind the program.</li> <li>Finally, write the code that follows the same logic which gives the same output for inputs similar to the ones for the executable files.</li> </ul>", "rules": "<b>Rules and Regulations</b> <ol> <li>The team size is 2.</li> <li>Participants can code in C, C++, Python or Java.</li> <li>The preliminary round will have 50 MCQ questions.</li> <li>Maximum time allotted is 60 minutes for the preliminary round.</li> <li>There is no negative marking in the preliminary round.</li> <li>For output/error questions in the preliminary round consider the required header files/libraries as included.</li> <li>15 teams will be selected for the final round based on their performance in the preliminary round.</li> <li>Each team will be given 10 executable files as .o files.</li> <li>Use of mobile phones, calculators or any other electronic device is not permitted during the event.</li> <li>The decision of the judges will be final. </li> <li>The rules are subject to change at any point of time and participants will be duly notified of it.</li> </ol>", "contact": "<div><p><b>Saran Narayan</b></p><p>Event Coordinator</p><p>+91 81292 13393</p></div><div><p><b>Vidyadheesha D N</b></p><p>Event Coordinator</p><p>+91 94956 00579</p></div>", "contactInfo": [{"name": "Saran Narayan", "designation": "Event Coordinator", "phone": "+91 81292 13393"}, {"name": "Vidyadheesha D N", "designation": "Event Coordinator", "phone": "+91 94956 00579"}], "prize": "8k", "registration": "No Additional Fee", "department": "Computer Science", "category": "Offline", "date": "02nd Nov", "time": "10:45 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/uploads/images/5629.png", "color": "cornsilk", "id": 19}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Circuimstance", "codename": "circuimstance", "about": "<b>“Can you outwit the Timekeeper?”</b>  <p>It's time to fire up your grey matter and bring out the savviness within; For Excel 2018 is here to take you through a fascinating fable that challenges your wits and knowledge!<br>  If you are truly passionate about Electronics , then come forth to hone your skills through an exciting narration of a dystopian future!<br>  Brush up your brain and boss the game!</p>", "format": "<p>Online event consisting of 5 rounds with 6 questions each. </p>", "rules": "<b>Rules and Regulations</b> <ol> <li>5 rounds with 6 questions each. Total of 30 questions</li> <li>First 4 rounds will have a bonus question, i.e, 5 normal questions + 1 bonus.</li> <li>Regular questions carry 5 points, and the bonus question carries 10 points.</li> <li>Successfully answering the bonus question will let the candidate skip 2 regular questions.</li> <li>Last round will have only regular question.</li> <li>In case of tie, winner will be decided on the basis of time.</li> <li>A candidate is permitted to attempt the next round only after completing the previous round(s).</li> <li>New rounds will be unlocked every 3-4 days.</li> <li>Questions can cover the entire EC syllabus.</li> </ol>", "contact": "<div><p><b>Ajay Kumar A</b></p><p>Event Coordinator</p><p> +91 94469 13086</p></div><div><p><b>Anson Avarachan</b></p><p>Event Coordinator</p><p>+91 96565 72241</p></div>", "contactInfo": [{"name": "Ajay Kumar A", "designation": "Event Coordinator", "phone": " +91 94469 13086"}, {"name": "Anson Avarachan", "designation": "Event Coordinator", "phone": "+91 96565 72241"}], "prize": "3k", "registration": "No Additional Fee", "department": "Electronics", "category": "Online", "date": "--", "time": "--", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "http://excelmec.org/static/images/circuimstance.png", "color": "royalblue", "id": 20, "buttons": [{"name": "Play Now", "link": "http://circuimstance.excelmec.org"}]}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Gamezone", "codename": "gamezone", "about": "<p><b>Game Zone</b> - The event where you show off your skills with your brain and fingers. We give you Rainbow Six Siege and Fifa to expose your skills.<br><br>Through the  all new fifa 19, you can use your tactics and skills to compete with the best players around you. Let your passion and focus overpower the opponent. You can choose any team that you are comfortable with. This will be a knockout event. You lose one, you are eliminated.  Tackle all of your opponents and go home with a prize of Rs.18k. You are given a chance to  bring your own joystick for the event.<br><br>Rainbow six siege -  Let teamwork drive you. It's an event where team strategy decides the game for you. This is  an online event in which participants will be from all over india in seas server. The top 2(based on points) teams will be given a chance to compete directly in semifinals offline at Excel .  Shoot sharp and  go home with Rs 18k.You can bring your own mouse and keyboard.</p>", "format": "<b>Rainbow Six Siege</b><br><p><b>First Phase </b>– Online<br><b>Second Phase</b> – Offline<br>An initial online pre event will be conducted. Teams need to register with an amount before entering the tournament. Teams securing the top positions will be provided  with a direct entry into the final stages of the offline event. A cash prize will be given to winner. Teams securing direct entry to the final stage of offline event need not pay the offline event entry fee.The tournament will played according to the provided rules and regulations.<br>Offline tournament will be conducted on the days of Excel. Teams are supposed to register with an amount to enter the event. The each round will be a knockout round. Number of rounds will be decided based on the number of teams registered.The tournament will be played according to the provided rules and regulations.</p><br><br><b>FIFA</b><br><p>The tournament will be conducted on the days of Excel. Players are supposed to register with an amount to enter the event. The each round will be a knockout round. Number of rounds will be decided based on the number of players registered.The tournament will be played according to the provided rules and regulations.</p>", "rules": "<b>FIFA</b><br><p><ol><li>All matches must be played in accordance with FIFA Laws of the Game, except as specifically modified as follows.</li><li>For ease of use all games will be played in “Kick Off” Mode.</li><li>Use of custom formations are not allowed.</li><li>Players are allowed to use multiple teams throughout the tournament as they please.</li><li>Away players are responsible for picking the jersey that does not resemble the home team jersey.</li><li>Players are only allowed to pause the game if their team is in possession of the ball.</li><li>If a player does not show for the game or forfeits during the game, he/she loses the game with the maximum score of 3-0. </li><li>The administration has the right to disqualify players from the tournament after misconduct or unethical behaviour during the Tournament. Disqualification means that the player is not allowed to play any more games in the Tournament and will automatically lose every next game with the maximum score of 3-0.</li><li>Upon kickoff, a player has to pass the ball at least three times before scoring.</li><li>All games will be played on the Playstation 4 console.</li><li>Frequent and purposeful pausing during game play may be subject to disqualification.</li><li>No sideline coaching is allowed. You may cheer or boo as the game progresses, but you may not offer advice to anyone playing a game.</li><li>If a player purposely turns off a game while it’s in progress, that player will be disqualified from the tournament.</li><li>All players must play the Game using the given game-play settings. Any deviation from these settings will result in automatic disqualification. If game settings are found to be wrong by the tournament administrators, the players and the game will be disqualified.</li><li>By attending the Fifa Tournament, participants agree without reservations to comply with these rules and regulations, as well as the decisions made by the coordinators of the tournament. The application of these rules and regulations is at the sole discretion of the coordinators. Any decisions made may overrule the following rules and regulations to maintain the spirit of competition. Participants have to obey the instructions made by the coordinators at all times.</li><li>Every participant is asked to maintain an adequate level of respect and friendliness with the other participants and the coordinators. Insults and unfair or disrespectful behaviour towards the coordinators and the other participants won’t be tolerated and will be punished, an immediate disqualification from the tournament.</li><li>Every participant has to stay ready and available for the duration of the tournament, or until his elimination from the tournament. Longer absence needs to be approved by the coordinators in order to avoid any sort of punishment.</li></ol><br>Half length: 4 minutes; 5 minutes in the final rounds.<br><ul><li>Number of players: 2.</li><li>Teams: Any international team or club with some experience. </li></ul></p><br><br><b>GAME SETTINGS</b><br><p><ul><li>Level: Legendary</li><li>Time of day: 08:00 PM</li><li>Season: Summer</li><li>Weather: Clear</li><li>Game Speed: Normal</li><li>Team: Club/Nation</li><li>Multiplayer Camera: Tele Broadcast</li><li>Camera Settings: Default</li><li>Time/Score Display: ON</li><li>Injuries: ON</li><li>Offsides: ON</li></ul></p><br><b>TEAM AND CONTROLLER SETTINGS</b><br><p><ul><li>Custom Tactics: Allowed</li><li>Custom Formations: Not Allowed</li><li>Passing Power Assistance: OFF</li><li>Defending: Tactical</li><li>FIFA Trainer: OFF</li></ul><br>Due to some inconsistencies, the combinations of certain teams may result in the game crashing, in which case either of the players may be asked to change teams</p><br><br><b>RAINBOW SIX SIEGE</b><br><p><ol><li>The maximum number of team members per team is 5.</li><li>Participants can use their own headphones, USB keyboards and USB mic.</li><li>Participants are strictly advised not to bring any sort of configuration files to the event. If any participant is found trying to use their own configuration files without the administrator’s permission during the event, their team will be disqualified without any warning.</li><li>The event will be controlled by an administrator who monitors the game server. The decision of the admin will be final and binding.</li><li>Use of glitches as an advantage won’t be entertained.</li><li>Players are not allowed to use Pick and Ban.</li><li>Communication among team members is allowed but cross team communication is strictly discouraged.</li><li>Teams are provided with the bomb as the objective in the prelims and in further rounds, the bomb as well as the secure area is disclosed.</li><li>Matches are played based on standard rules.</li></ol><br><b>Online Rules and Regulations</b><br><ol><li>Players are responsible for their own hardware and internet connection. Matches will not be rescheduled because of technical issues or substitute a player. If a team can´t play with the amount of players which are written in the requirements then this will be resulted as forfeit.</li><li>Everyone is responsible to have a connection (ping) as good as possible for their team region and technical situation. Also, all downloads and other programs which are unnecessary for the match must be turned off. For abusing this rule, the team can be disqualified.</li><li>The ping limit for a match is 150 ms. If a player is over this value please try to do a re-host first, before a protest is opened. Be sure a dedicated server was created. In the case the player has still a ping over 150 ms and it´s not possible to play the match without problems, a protest can be opened. It only counts as high ping if the ping is continuously over 150! By opening a protest due to high ping the match mustn't be finished and the team must hand in at least three screenshots of the scoreboard which was taken in different time over two rounds (In action phase).</li><li>Any changes to sprites, skins, score boards, crosshairs are strictly disallowed, also only the official models are allowed. If a player plays with custom files (not models) or removed files that have been installed by the game, then this will be penalized with two penalty points per player. If a player plays with custom models, then this will be penalized with five 6 penalty points per player and the opponent of the match may request a rematch.</li><li>If a player drops from the server during a match, the round will continue uninterrupted until the end (Round starts with the first second of the preparation phase). After completion of the round, the player who disconnected will be allowed to re-join the server or a re-host can be requested. The match is considered “live” when the first round has started. At least the half of all players need to remain and the match need to be played until the match end and a winner is decided. If this isn’t possible due to connection issues, it will be considered as a forfeit in favour for the team who is able to have all players on the server.</li><li>Every team can re-host the server once in a match. If problems like this appear again, such as a player dropping out when the match has already been re-hosted, the team need to play the match with the remaining players to its conclusion. Any abuse of this rule will be considered as deception and will result in penalization and including disqualification of the team.</li><li>In a re-hosted game, each player need to choose the same settings as they picked at the start of the original game. All ruling which isn’t explained in the previous point, the teams had to open a protest ticket. Only admins of the staff can decide, if the game will be complete restarted by a score 0:0.</li><li>Any actions that result in an unfair advantage are illegal. This includes bug and glitch using of any kind. In a tournament by using any bug or glitch, the team got a warning, by the second time of using it, the team will be disqualified.</li><li>Killing somebody who already spawned, moved out of cover or is spawnrushed is considered spawnpeaking and will not be rated as glitching / bug using.</li></ol><br><b>Game Settings</b><br><ul><li>All matches will be played with 5 players per team in a Bo2</li><li>3.1. Settings</li><li>Playlist Type: Normal Mode</li><li>Server Type: Dedicated Server</li><li>Voice Chat: Team Only</li><li>Time of the Day: Day</li><li>HUD Settings: Pro League</li><li>3.2. MATCH SETTINGS</li><li>Number of Bans: 4</li><li>Ban Timer: 30</li><li>Number of Rounds: 10</li><li>Attacker/Defender role swap: 5</li><li>Overtime: 3 Rounds</li><li>Overtime score difference: 2</li><li>Overtime role change: 1</li><li>Objective Rotation Parameter: 2</li><li>Objective Type Rotation: Rounds Played</li><li>Attacker unique spawn: On</li><li>Pick Phase Timer: 25</li><li>6TH Pick Phase: On</li><li>6TH Pick Phase Timer: 25</li><li>Damage handicap: 100</li><li>Friendly fire damage: 100</li><li>Injured: 20</li><li>Sprint: On</li><li>Lean: On</li><li>Death Replay: Off</li><li>3.3. GAME MODE: TDM BOMB</li><li>Plant duration: 7</li><li>Defuse duration: 7</li><li>Fuse time: 45</li><li>Preparation: 45</li><li>Action: 180</li><li>3.4. Operator</li><li>All Operators are allowed to use.</li><li>3.5. Mappool</li><li>Bank</li><li>Border</li><li>Club House</li><li>Consulate</li><li>Coastline</li><li>Oregon</li><li>Villa</li></ul></p>", "contact": "<div><p><b>Akash K.A (Rainbow Six Siege)</b></p><p>Event Coordinator</p><p>+91 79074 59595  </p></div><div><p><b>Anson Avarachan (FIFA)</b></p><p>Event Coordinator</p><p>+91 80754 50229 </p></div><div><p><b>Athul Joseph (FIFA)</b></p><p>Event Coordinator</p><p>+91 82816 69008 </p></div>", "contactInfo": [{"name": "Akash K.A (Rainbow Six Siege) ", "designation": "Event Coordinator", "phone": "+91 79074 59595  "}, {"name": "Anson Avarachan (FIFA) ", "designation": "Event Coordinator", "phone": "+91 80754 50229 "}, {"name": "Athul Joseph (FIFA) ", "designation": "Event Coordinator", "phone": "+91 82816 69008 "}], "prize": "25k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Online/Offline", "date": "03rd - 4th Nov", "time": "10:00 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/game-zone.png", "color": "lightblue", "id": 21, "buttons": [{"name": "Register : FIFA", "link": "https://goo.gl/forms/hp4FAwF0tr2kgIYB3"}, {"name": "Rainbow Six Siege", "link": "https://goo.gl/forms/kNwRjM2fdqQPqUDD2"}]}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Tiki Taka", "codename": "tiki-taka", "about": "<p>Tiki Taka is a 3-on-3 football tournament. The matches are played in knockout format. Contestants can register exclusively for this event at the venue, i.e., Excel registration is not required for this event.</p>", "format": "<p>Tiki Taka is a 3-on-3 football tournament. The matches are played in knockout format. Contestants can register exclusively for this event at the venue, i.e., <b>Excel registration is not required for this event.</b></p>", "rules": "<b>EVENT RULES</b> <ul> <li><b>PLAYERS:</b> Only 3 field players are allowed during the play and at most 1 sub per team. Players cannot play for multiple teams. Goalkeepers are not allowed. Substitutions may occur for any dead ball situation, but players must get the referee's approval to enter.</li>  <li><b>NO OFFSIDES:</b> Side tackling is not permitted.</li>  <li><b>GOAL AREA:</b> The goal area, which will be marked, is directly in front of the goal. Defenders cannot touch the ball within the goal area, however any player may move through the goal area. If a defender touches the ball in the goal area, a penalty kick is awarded to the offensive team. </li>  <li><b>GAME DURATION:</b> Each game will last 10 minutes. If no goals have been scored after the allotted time or if the scores are tied, then a penalty shootout shall follow. In a penalty shootout, each team is awarded 3 penalty kicks. </li>  <li><b>THREE YARD RULE: </b>In all dead ball situations, defending players must stand at least 3 yards away from the ball. If the defensive player's goal area is closer than 3 yards, the ball shall be placed 3 yards from the goal area in line with the place of the penalty.</li>  <li><b>DEAD BALLS: </b>All dead ball kicks (kick-ins, free kicks, kick-offs) are indirect with the exception of penalty kicks. </li>  <li><b>KICK OFF: </b>May be taken in any direction. </li>  <li><b>PENALTY KICKS: </b>Shall be awarded if, in the referee's opinion, a scoring opportunity was nullified by the infraction. Penalty kicks have to be taken from the center of the field and no goalkeeper from the opposing team is allowed. </li>  <li><b>PLAYER EJECTION (YELLOW/RED CARD):</b> The referee has the right to eject a player from the game for continual disobedience or as a result of an incident that warrants sending the player out. A Yellow Card will be issued as a warning and a Red Card will be issued for a serious offence or on receipt of a second Yellow Card. The tournament organizers will decide suspension from additional games. </li> </ul>  <b>GENERAL RULES</b>  <ul> <li>Players and spectators are expected to act in the nature of good sportsmanship at all times. </li>  <li>Abuse of the referees will not be tolerated. </li>  <li>Any instance of misconduct will disqualify the responsible team from the event. </li>  <li>Organizers reserve the right to make decisions regarding conflicts and other issues.</li> </ul>", "contact": "<div><p><b>Freddy Ittiera</b></p><p>Event Coordinator</p><p>+91 97455 18176</p></div><div><p><b>Athul Babu</b></p><p>Event Coordinator</p><p>+91 94970 41607</p></div>", "contactInfo": [{"name": "Freddy Ittiera", "designation": "Event Coordinator", "phone": " +91 97455 18176"}, {"name": "Athul Babu", "designation": "Event Coordinator", "phone": "+91 94970 41607"}], "prize": "8k", "registration": "Rs. 300/- Per Team", "department": "Non-Tech", "category": "Offline", "date": "02nd - 4th Nov", "time": "10:00 AM", "venue": "Ground ,Govt. Model Engineering College, Thrikkakara", "img": "http://excelmec.org/static/images/tikitaka.png", "color": "rgb(47, 180, 84)", "id": 22}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Instant Photography", "codename": "instant-photography", "about": "<p>A million things can happen in a moment. From myriad emotions to familiar scents, places and it’s people to memories and journeys, a moment is never enough. Photography is the art of weaving a million stories from a single moment. It’s never just about what is seen, it’s always about how it is seen and experienced. For those who believe that immortality is just a click away, Excel 2018 brings you ‘The Third Eye Photography Contest’ in the memory of Vineeth Marar.<br>Become a storyteller, capture defining moments and share your experience through images. Ignite passions, initiate thought and inspire action through the power of the lens.</p>", "format": "<p>Participants will be given a theme during the days of excel 2018 and will be asked to take photographs based on this given theme. Participants can submit at most 3 photographs based on the particular theme by mailing it to <a href=\"mailto:thirdeye@excelmec.org\">thirdeye@excelmec.org</a> . Photographs are awarded marks based on the content, originality and relevance to the theme. </p>", "rules": "<p><ol><li>All participants should be a undergraduate student.</li><li>Photography, using all types of cameras (DSLR, SLR, Mobile cameras) is permitted. The type of camera must be mentioned along with each entry.</li><li>All entries must be submitted in digital format via e-mail. Mails must be sent to thirdeye@excelmec.org.</li><li>All entries must contain a <b>Short description</b> of the photo, the name of the participant, name of the college/organization/school, phone number and, if possible, the exif details of the photo.</li><li>All photographs must be in <b>JPEG</b> or <b>JPG</b> format.</li><li>Each entrant may submit at most <b>3 photographs for a theme</b> with respective descriptions. Each photo must be less than <b>8MB</b> in size.</li><li><b>Post processing</b> of any kind is explicitly <b>forbidden</b> and is a criterion for <b>disqualification</b>.</li><li><b>Watermarks</b> of any kind are <b>NOT</b> allowed. Submitted pictures will be watermarked by the event organisers so as to prevent the misuse of the submitted picture.</li><li>Presence of any sort of <b>vulgarism, racism or provocation</b> as well as copied entries, if found with valid proof, will be disqualified and deleted from the album immediately.</li><li>By submitting an entry, each entrant agrees to the official rules and warrants that the entry complies with all the guidelines in the official rules.</li><li>This is skill-based contest and it plays an important part in the determination of winners.</li><li>Photos that portray or otherwise include inappropriate and/or offensive content, including provocative nudity, violence, human rights and/or environmental violation, and/or any other contents deemed to be contrary to the law, religious, cultural & moral traditions and practices of India, are strictly prohibited and will be immediately disqualified.</li><li>Submitted photos must be original, created and/or taken by the contestant. It must not contain any materials owned or controlled by a third party for which you have not obtained a license, must not infringe the copyright, trademark, moral rights, rights of privacy/publicity or intellectual property rights of any person or entity.</li><li>Excel 2018 reserves the right to call for original JPEG or RAW files with unchanged EXIF for the purpose of authentication. An image maybe disregarded if this information cannot be provided.</li><li>Rules are subject to change at any point in time.</li></ol><br><b>RELEASE</b><br>The winning photograph will be released on Excel 2018 <a href=\"https://www.facebook.com/excelmec/\">Facebook</a> and <a href=\"https://www.instagram.com/excelmec/\">Instagram</a> page, at the end of the event.<br>Upon winning, the participant should submit College ID proof along with the original photograph.<br>Odds of winning depend upon the number of eligible entries received and the skill displayed by the entrant.<br><br><b>LICENSE</b><br>All entries retain the copyright to their photograph, for the duration of copyright, and may use each photograph and description for advertising, marketing and promotional purpose to any and all media now known or hereafter created.</p>", "contact": "<div><p><b>Atul Krishnan</b></p><p>Event Coordinator</p><p>+91 95441 20630  </p></div> <div><p><b>Tinu Mathew A</b></p><p>Event Coordinator</p><p>+91 97467 75597</p></div>", "contactInfo": [{"name": "Atul Krishnan ", "designation": "Event Coordinator", "phone": "+91 95441 20630  "}, {"name": "Tinu Mathew", "designation": "Event Coordinator", "phone": "+91 97467 75597 "}], "prize": "6k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "02nd - 04th Nov", "time": "--", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/third-eye-photography.png", "color": "lightgrey", "id": 23}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "KLUGE", "codename": "kluge", "about": "<p>If you always have complex answers to every simple question then Kluge is wholly yours! Bend the rules, think complicated and build the best, most unusual contraption that can accomplish a specific simple task. Bring out the craziness in you and you win the game. </p>", "format": "<p>It is a three stage, team based event.</p><br><b>Round 1:Preliminary Round</b><br><p>A written round that will evaluate teams on their reasoning, logical and basic mechanical skills. 6 teams will qualify to the next round.</p><br><b>Round 2: Elimination Round</b><br><p>Teams will be given tasks to provide innovative solutions to given problems. 3 teams will be shortlisted to the next round.</p><br><b>Round 3:Creation Round</b><br><p>In the final round, teams will be given a task, a set of material to perform the task and will be required to create a complex machine that completes the task in as many steps as possible and the output from the device should be optimum. The machine must perform the task in at least the minimum number of steps stipulated.</p>", "rules": "<p><ol><li>Event is open for all.</li><br><li>Teams can have <b>4</b> members.</li><br><li>Cross-college teams are allowed.</li><br><li>Only the provided set of materials may be used in the creation of the machines.</li><br><li>Malpractices and sabotaging other teams' machines will lead to immediate disqualification.</li><br><li>Judges' decision will be final.</li><br><li>Organizers reserve the right to make decisions in case of conflicts and other issues.</li><br><li>Rules are subject to change. All rules will be explained at the event as well.</li></ol></p>", "contact": "<div><p><b>Nikitha Lathief</b></p><p>Event Coordinator</p><p>+91 9995528609 </p></div> <div><p><b>Joseph Navin Shaji</b></p><p>Event Coordinator</p><p>+91 9495178614 </p></div>", "contactInfo": [{"name": "Nikitha Lathief ", "designation": "Event Coordinator", "phone": "+91 9995528609  "}, {"name": "Joseph Navin Shaji", "designation": "Event Coordinator", "phone": "+91 9495178614 "}], "prize": "6k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "04th Nov", "time": "10:00 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/kluge.png", "color": "yellow", "id": 24}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "The Game Plan", "codename": "the-game-plan", "about": "<p>Excel presents The Game Plan, an event centered around football. A test for true football fanatics among us. One to weed out the newbies from the pack. Many say they love the sport but few truly follow it with a passion.<br> Every group has its share of football-crazed guys and girls. We hope to bring them together so that they may showcase their knowledge of the sport, ability to make quick decisions and their mettle in the game we all love and cherish, FIFA.</p>", "format": "<b>Round 1: PRELIMINARY ROUND</b> <p>Prelims include a written test consisting of 25 objective questions.10 teams will be shortlisted from this round.</p>  <b>Round 2: INTERMEDIATE ROUND - 1</b> <p>The 10 shortlisted teams will go up against each other in a quiz. The top 5 teams will advance to the final two rounds. Teams will be awarded points based on their performance.</p>  <b>Round 3: INTERMEDIATE ROUND – 2</b> <p>The 5 top teams from the quiz round will have to auction for players to form a team in the final round. Teams will be awarded points based on the strength of the team they form.</p>  <b>Round 4: FINAL ROUND</b> <p>In the final round, the top 3 teams from last 2 rounds will be pitched against each other in a league format(FIFA 18). Teams will be awarded points as per their performance in the league. The team will the most points accumulated over the last three rounds will be the winners of the event.</p>  <b>Points Weighting</b> <p>In decreasing order of points weighting:</p> <ol> <li>Round 3: INTERMEDIATE ROUND – 2 (Auction)</li>  <li>Round 4: FINAL ROUND (FIFA)</li>  <li>Round 2: INTERMEDIATE ROUND – 1 (Quiz)</li>  <p>Registration fee: Rs 300/- per team if you are participating solely for this event.  Rs 200/- per team if you are registering for Excel.</p>", "rules": "<b>Rules and Regulations</b> <ol> <li>This is a team event.</li>  <li>Teams can have 2-4 members.</li> <li>Cross-college teams are allowed.</li>  <li>The contest is open to all age groups.</li>  <li>The organizers reserve all rights to disqualify any team for using unfair means at any stage of the event.</li>  <li>In case of any discrepancies, decision of the coordinators shall be considered final and binding for all the teams.</li> <li>Additional rules will be provided by the organizers onsite.</li>  <li>Any violation of the rules provided by the organizers, will lead to immediate disqualification.</li>  <li>The judges' decision will be final.</li>  <li>Rules are subject to change at any point in time.</li>  <li>Participants will be duly notified of any changes.</li>  </ol>", "contact": "<div><p><b>RAHUL M</b></p><p>Event Coordinator</p>+91 86063 63923</p></div><div><p><b>ALTHAF SALIM</b></p><p>Event Coordinator</p><p>+91 77363 76523</p></div>", "contactInfo": [{"name": "RAHUL M", "designation": "Event Coordinator", "phone": "+91 86063 63923"}, {"name": "ALTHAF SALIM", "designation": "Event Coordinator", "phone": "+91 77363 76523"}], "prize": "15k", "registration": "Rs 300/- per team if you are participating solely for this event. Rs 200/- per team if you are registering for Excel.", "department": "Non-Tech", "category": "Offline", "date": "03rd Nov", "time": "9:30 AM", "venue": "Media Hall ,Govt. Model Engineering College, Thrikkakara", "img": "http://excelmec.org/static/images/game-plan.png", "color": "violet", "id": 25}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Lost-The maze", "codename": "lost-the-maze", "about": "<p> A labyrinth or maze is an ancient symbol that relates to wholeness. It represents a journey to the center and back again to the world via a single entry and exit point.<br>Thus as a part of <b>EXCEL 2018</b> we present the non-technical event <b>LOST</b>.  Since obstacles never come in circles , we must overcome the obstacles just like the maze which is a real invented one.</p>", "format": "<b>Starting Phase :</b><br><p>All groups will be allowed to participate and complete the maze that is set up. There will be no preliminary written round for the event.<br><ul><li>A group of three members will be made to enter via different entries to the maze.</li><li>Each person will be given an IR remote. They will have to complete the first maze section after which they'll all meet together and place a working remote at the first junction.</li><li>After that they will have a second section of maze and at the second junction they'll have to place the next working remote and go ahead.</li><li>The third section consists of two parts adventurous part and maze part. The contestants are allowed to select the third section as per their choice .</li><li>After completing the sections all three contestants must come to the exit together with the third remote and the time taken by the team will be noted.</li></ul></p><br><br><b>Final Phase :</b><br><p>The finalists will be selected on the basis of the time they took to complete the starting phase. <br>Lucky draw coupons will be sold to the students out of which six students will be selected who will get direct entry the final round.<br><ul><li>Teams selected to the final round will be allowed to participate.</li><li>The procedures followed will be same as that of the starting phase.</li><li>However there will be few changes within the maze in order to make the final round different from what they completed in the starting phase.</li></ul></p>", "rules": "<p><ol><li>Team consisting of 3 members will be allowed to participate after registration.</li><br><li>Mobile phones or any other such communication devices are not allowed.</li><br><li>Team exceeding the cut-off time will be disqualified.</li><br><li>The decision of the co-ordinators will be final.</li></ol></p>", "contact": "<div><p><b>Athul Krishna Sadanandan</b></p><p>Event Coordinator</p><p>+91 7012833359  </p></div> <div><p><b>Akash Krishna</b></p><p>Event Coordinator</p><p>+91 7559069588 </p></div>", "contactInfo": [{"name": "Athul Krishna Sadanandan ", "designation": "Event Coordinator", "phone": "+91 7012833359 "}, {"name": "Akash Krishna", "designation": "Event Coordinator", "phone": "+91 7559069588"}], "prize": "8k", "registration": "Additional Fee: Rs 100.", "department": "Non-Tech", "category": "Offline", "date": "02nd - 4th Nov", "time": "10:00 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "id": 26, "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSeiV9GUD9Dne-AQ459HklPzzrwc11PfjVYYkwgxqHbqSfqK7A/viewform?usp=pp_url"}], "color": "cornsilk", "img": "https://excelmec.org/static/uploads/images/lostlogo.png"}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Reel Life", "codename": "reel-life", "about": "<b>ShortFilm Festival </b><br><p>From all the entries, 10 films will be shortlisted by the panel. The top 10 films will be played on the day of the event in front of the panel of filmmakers who will then decide the winners. Along with the screening, there will be an interactive session where the makers can talk with the audience about their film and their journey as a team. The competition is open to all and the people involved in the making of the short film need not be a student. The YouTube or the Google drive link to the film is to be shared through the registration form, to the mail ID specified and the payment is to be done via tez or paytm. The top 3 films selected by the panel of judges will be awarded with cash prizes.</p>", "format": "<p><ul><li>From all the entries, 10 films will be shortlisted by the panel.</li><br><li>The Top 10 films will be screened in front of the panel of filmmakers on the day of the event, who will then decide the winners. </li><br><li>Along with the screening, there will be an interactive session where the makers can talk with the audience about their film and their journey as a team.</li><br><li>The top 3 films will each receive cash prizes of Rs 6000, Rs 4000, and Rs 2000, along with certificates</li><br><li>Certificates will be awarded to the  Best Actor, Best Actress, Best Director, Best Story, Best Cinematographer and Best Editor.</li><br><li>Online certificates will be awarded to all the shortlisted entries.</li><br></ul></p>", "rules": "<p><ol><li>It is an open event. Entries are invited from all. </li><br><li>The entries have to be original. Content copied from any external source can lead to direct disqualification.</li><br><li>Entry fee is Rs. 200 per team which can be sent through Paytm or Tez sent along with the DVD.</li><br><li>The film cannot exceed a time duration of 30 minutes (Including title card and credits). </li><br><li>Entries can be in any language but suitable subtitles must be provided for languages other than Malayalam.</li><br><li>There is no subject/theme for the competition.</li><br><li>All films must be submitted in a single DVD (DVD-R, DVD+R, DVD-R DL, DVD+R DL) and encoded in industry-standard video formats such as AVI, VOB, MP4, MKV, WMV ,MOV or MPEG.</li><br><li>The entries must be sent along with a filled registration form and a copy of the ID proof of one of the crew members (preferably director, cinematographer or actor).</li><br><li>Last date for sending entries is 31 October, 2018.</li><br><li>If the film has already been released, a YouTube link to the video should be shared with the coordinators of the event.</li><br></ol></p>", "contact": "<div><p><b>Levis Raju</b></p><p>Event Coordinator</p><p>+91 9446594409 </p></div> <div><p><b>K T Joseph</b></p><p>Event Coordinator</p><p>+91 9633871299</p></div>", "contactInfo": [{"name": "Levis Raju ", "designation": "Event Coordinator", "phone": "+91 9446594409 "}, {"name": "K T Joseph", "designation": "Event Coordinator", "phone": "+91 9633871299 "}], "prize": "12k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "04th Nov", "time": "9:30 AM", "venue": "Media Hall, Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/reel-life.png", "color": "khaki", "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/1u-O9oXpyWDeuWHVrGJoPlu7-hh1jNtXbobbCfEzXULM"}], "id": 27}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "RJ Hunt", "codename": "rj-hunt", "about": "<p>Have you ever wanted to be the change you wanted to see in this world? Ever wanted to voice your opinion but never got the chance? Or have you ever just wanted to speak because you are good at it? Excel 2018 brings you the <b>‘RJ HUNT’</b>! <br>If you have great communication skills, amazing talent to get your points across and have always wanted to be a cool RJ, this is your perfect opportunity. Let us bridge thoughts, bridge opinions, bridge actions, BRIDGE REALMS.</p>", "format": "", "contact": "<div><p><b>Arjun S. K</b></p><p>Event Coordinator</p><p>+91 8113014473 </p></div> <div><p><b>Akhila Aloshious</b></p><p>Event Coordinator</p><p>+91 7012908338 </p></div>", "contactInfo": [{"name": "Arjun S. K ", "designation": "Event Coordinator", "phone": "+91 8113014473  "}, {"name": "Akhila Aloshious", "designation": "Event Coordinator", "phone": "+91 7012908338 "}], "prize": "8k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "04th Nov", "time": "11:30 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "color": "cornsilk", "id": 28, "rules": "<p><ol><li>Open to both MECians and Non- MECians.</li><br><li>Spot registration also available.</li></ol></p>", "img": "https://excelmec.org/static/uploads/images/microphone.png", "buttons": [{"name": "Register", "link": "https://docs.google.com/forms/d/e/1FAIpQLSf0YbffojOEAOQYvrr6A1uLJ1kSeUp0dz_U8ALJYoRV94BMjA/viewform?usp=sf_link"}]}, {"contributors": [{"username": "neha", "email": "nehamj798@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 6, "createdAt": "2018-10-17T14:40:55.094Z", "updatedAt": "2018-10-17T14:41:55.880Z"}], "active": true, "name": "Spider Web", "codename": "spider-web", "about": "<p>Spiderweb, one of the non-tech event which we are planning to conduct on days of excel 2k18. Basically it tests one’s team spirit and his ability to perform in a team in various games. It is divided into different rounds and each round may contain 1/2 rounds.<br><br>The games involved may need logical thinking and at the same time the combined effort of all the members of the team to qualify. All games will be held in the college outside itself.</p>", "format": "<b>Preliminary Round :</b><br><p>This will be a pen and paper round which will be 30 mins long. Top 10 teams(each team consisting of 4 members each) from this round will be selected to the next round. The results will be published within 45 mins.</p><br><br><b>First Round :</b><br><p>In addition to 10 teams from the preliminary round, 2 teams from the audience will be selected into this round. So total 12 teams will compete in this round. And 6 of them will be selected into the next round.</p><br><br><b>Second Round:</b><br><p>This will be a team event of 4. Each team will be given a task to complete. Teams will compete against each other and top 3 teams which finishes all the tasks in the shortest time will qualify for the next round.</p><br><br><b>Third Round :</b><br><p>Here the 3 teams will compete in another set of games and top 2 teams will qualify for the final round.</p><br><br><b>FINAL ROUND :</b><br><p>The final round consists of 2 teams and 8 participants. In this round, the team which complete all tasks in the shortest time wins.</p>", "rules": "<p><ol><li>This is a team event of 4 members per team.</li><br><li>Inter-college teams are allowed.</li><br><li>The contest is open to students from all the colleges.</li><br><li>Participants need to produce a valid identity card of their respective institutes.</li><br><li>The organizers reserve all rights to disqualify any team for using unfair means at any stage of the event.</li><br><li>In case of any discrepancies decision of the coordinators shall be considered final and binding for all the teams.</li><br><li>Additional rules will be provided by the organizers on site.</li><br><li>Any violation of the rules provided by the organizers will lead to immediate disqualification.</li><br><li>The judges’ decision will be final.</li><br><li>Rules are subject to change at any point in time.</li><br><li>Participants will be duly notifed of any changes.</li><br></ol></p>", "contact": "<div><p><b>Kartik Prakash</b></p><p>Event Coordinator</p><p>+91 8547595763  </p></div> <div><p><b>Jefrin Gio</b></p><p>Event Coordinator</p><p>+91 9947814590 </p></div>", "contactInfo": [{"name": "Kartik Prakash ", "designation": "Event Coordinator", "phone": "+91 8547595763  "}, {"name": "Jefrin Gio", "designation": "Event Coordinator", "phone": "+91 9947814590 "}], "prize": "5k", "registration": "No Additional Fee", "department": "Non-Tech", "category": "Offline", "date": "02nd Nov", "time": "10:45 AM", "venue": "Govt. Model Engineering College, Thrikkakara", "img": "https://excelmec.org/static/images/spider-web.png", "color": "bisque", "id": 29}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Crime Scene Investigation", "codename": "crime-scene-investigation", "about": "<p>To investigate a crime is indeed to solve it. Every man at the bottom of his heart believes that he is a true detective. Are you eager to showcase your problem solving skills and bring out the detective in you? Excel 2018 brings you <b>“CRIME SCENE INVESTIGATION”</b>.<br> Come investigate the crime, interrogate the witnesses and suspects and finally bring out the killer to justice.</p>", "format": "<b>Round 1: PRELIMINARY ROUND</b> <p>Prelims include a written test consisting of 38 questions based on logical and reasoning skills, which should be finished within 30 minutes. 10 teams will be shortlisted from this round.</p><br><b>Round 2: VIDEO ROUND</b><p>A 7-8 minute video will be displayed to the 10 shortlisted teams. Based on the video they must be able to answer 20 questions and a brief summary within 5 minutes. The top 6 teams will be selected to next level.</p><br><b>Round 3: INTERMEDIATE ROUND</b> <p>It will be a 3 level game in which the shortlisted teams must qualify each level to enter the next level. These 6 teams are asked to decode puzzles and arrive at clues at various levels and at the end they will be provided with the sketch of a person and the spot inside the college campus where one could find the matching person. The top 4 teams to finish all the levels will enter finals. </p><br><b>Round 4: FINAL ROUND</b> <p>The finalists will be taken to the crime scene. Solve the crime within the allotted time by taking the necessary snapshots, interrogating suspects and witnesses within an hour. Present a final report regarding the complete crime.</p>", "rules": "<b>Rules and Regulations</b> <ol> <li>This is a team event consisting of 2 members per team.</li> <li>Inter -college teams are allowed.</li> <li>The contest is open to students from all colleges.</li> <li>Participants need to produce a valid identity card of their respective institutes.</li> <li>The organizers reserve all rights to disqualify any team for using unfair means at any stage of the event.</li> <li>In case of any discrepancies, decision of the coordinators shall be considered final and binding for all the teams.</li> <li>Additional rules will be provided by the organizers on site.</li> <li>Any violation of the rules provided by the organizers, will lead to immediate disqualification.</li> <li>The judges&#39; decision will be final.</li> <li>Rules are subject to change at any point in time.</li> <li>Participants will be duly notified of any changes.</li> </ol>", "contact": "<div><p><b>Simna Siraj</b></p><p>Event Coordinator</p>+91 89213 34995</p></div><div><p><b>Sruthy Sreekumar</b></p><p>Event Coordinator</p><p>+91 95399 57969</p></div>", "contactInfo": [{"name": "Simna Siraj", "designation": "Event Coordinator", "phone": "+91 89213 34995"}, {"name": "Sruthy Sreekumar", "designation": "Event Coordinator", "phone": "+91 95399 57969"}], "prize": "8k", "registration": "No Additional Fee", "department": "Non Tech", "category": "Offline", "date": "03rd Nov", "time": "9:30AM", "venue": "Govt. Model Engineering College", "img": "http://excelmec.org/static/images/csi.png", "color": "midnightblue", "id": 30}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "4*120", "codename": "4-120", "about": "<p>Summon a team of <b>4</b> to push your understanding, synchronization and coding ability to the absolute limit over <b>120</b> minutes as you create and execute challenging programs.<br>Does your squad have the trust and the drive to surpass every other team on your path to victory?</p>", "format": "<b>Preliminary Round:</b> <ol> <li>This will be a pen and paper round of 60 mins duration.</li> <li>Top 8 teams (each team consisting of 4 members) from this round will be selected to the Final round.</li> <li>The result for this round will be published within 45 mins.</li> </ol> <br><b>Final Round: </b><p>All of the 4 participants in each group will have to complete a coding question in 2 hours set to the following criteria:</p> <ol> <li>Only the group leader can see the question and he/she can code for the first 15 mins.</li> <li>Once the first 15 min mark is over, the other members, one after another - each one for 15 mins, should continue coding without knowing the question.</li> <li>After one hour, the next cycle of coding begins. Now, each member in a team gets to code for 10 mins each and for the next cycle, the time reduces to 5 mins each.</li> <li>The team that quickly and successfully completes the coding round will be the winner.</li> </ol> <b>Question Format:</b> <p>Three types of questions - A, B and C<br>A - easiest and lowest weightage C - difficult and highest weightage<br><br>Once you’ve chosen a question and want to skip it, you can only choose a more difficult question.<br>E.g. If you choose A and want to skip, you can either choose B or C but you can't return to A. If you choose B, you can only skip to C.</p> <b>Tie-Breaker Round:</b> <p>All the 4 participants in each group will have to complete another coding question within 20 mins.</p>", "rules": "<b>Rules and Regulations</b> <ol> <li>College ID cards are mandatory. Any other forms of identification shall not be entertained.</li> <li>Use of mobile phones or any other electronic device is not permitted during the event.</li> <li>All participants should be undergraduate students.</li> <li>A team shall comprise of exactly 4 members. Cross college teams are allowed.</li> <li>In the event of a tie, a tie breaker will be the deciding factor.</li> <li>The decision of the judges will be final.</li> <li>Rules are subject to change at any point of time and participants will be duly notified of it.</li> </ol>", "contact": "<div><p><b>Gopika T R</b></p><p>Event Coordinator</p>+91 8289840424</p></div><div><p><b>Sreehari Sankar</b></p><p>Event Coordinator</p><p>+91 9497823173</p></div>", "contactInfo": [{"name": "Gopika T R", "designation": "Event Coordinator", "phone": "+91 8289840424"}, {"name": "Sreehari Sankar", "designation": "Event Coordinator", "phone": "+91 9497823173"}], "prize": "8k", "registration": "No Additional Fee", "department": "Computer Science", "category": "Offline", "date": "04th Nov", "time": "11:00AM", "venue": "Govt. Model Engineering College", "img": "https://excelmec.org/static/uploads/images/4-120.png", "color": "palegreen", "id": 31}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Algorithms", "codename": "algorithms", "about": "<p>Showcase your ability to solve the most complex and perplexing of problems to win. Defying the norm, this event will challenge you, surprise you and test you till you break or fight back!<br>Remember, it’s not just about getting it right, it’s also about how you do it!<br><i>So power up your neurons and discover the most efficient algorithms!</i></p>", "format": "<b>Preliminary Round:</b> <ul> <li>This is an individual event.</li> <li>General Tech based MCQ Questions to be solved in 30-mins.</li> <li>30 questions - 10 starred and 20 normal.</li> <li>Star questions are for 4 marks, normal ones for 2 marks. Wrong answers give a negative of 1 mark.</li> <li>Individuals who qualify will move onto the final round.</li> </ul> <br><b>Final Round:</b> <ul> <li>Consists of a pure coding competition in a 2-hour time limit.</li> <li>The competition will be conducted on the online platform HackerRank.</li> <li>The person with the highest score will be the winner. In case of a tie, the complexity of the programs and the time taken to complete will be considered.</li> <li>The decision of the admin would be final in case of any discrepancy. </li> </ul>", "rules": "<b>Rules and Regulations</b> <ol> <li>Participants can code in C, C++, Java or Python.</li> <li>Use of mobile phones is not permitted during the event.</li> <li>The individual that solves the most number of problems/more number of test cases in the least time will be crowned the winner. (Highest points)</li> <li>Programs with least complexity will be given preference.</li> <li>The decision of the judges will be final. </li> <li>The rules are subject to change at any point of time and participants will be duly notified of it.</li> </ol>", "contact": "<div><p><b>Arjun Nair</b></p><p>Event Coordinator</p>+91 90375 34020</p></div><div><p><b>Siva R</b></p><p>Event Coordinator</p><p>+91 70125 46915</p></div>", "contactInfo": [{"name": "Arjun Nair", "designation": "Event Coordinator", "phone": "+91 90375 34020"}, {"name": "Siva R", "designation": "Event Coordinator", "phone": "+91 70125 46915"}], "prize": "12k", "registration": "No Additional Fee", "department": "Computer Science", "category": "Offilne", "date": "03rd Nov", "time": "10:30 AM", "venue": "Govt. Model Engineering College", "img": "http://excelmec.org/static/images/algorithms.png", "color": "aqua", "id": 32}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Lord Of Code", "codename": "lord-of-code", "about": "<p>Do you believe that coding is an art and you're its Picasso?<br>Do you have the urge to prove that you're the best?<br><br>Here is the perfect canvas to express yourself and gain recognition. Get your coding buddy to share the heat while you switch seats to compete in the best tag team coding event of the year.<br>Buckle up! Start your PCs! And compile to success to become the next <b>'Lord of the Code'</b>!<br></p>", "format": "<b>Preliminary Round:</b> <ul> <li>This will be a pen and paper round of 60 mins duration.</li> <li>Top 8 teams (each team consisting of 2 members) from this round will move on to the final round.</li> The result for this round will be published within 45 mins</li> </ul> <br><b>Final Round:</b> <ul> <li>Consists of two rounds running parallel to each other for 3 hours.</li> <li>One half of a team will solve logical questions while the other half will be engaged in coding. </li> <li>The roles will be switched at a 90 minute mark.</li> <li>Both these rounds will have 2 questions each and the winner will be decided by the highest score.</li> </ul>", "rules": "<b>Rules and Regulations</b> <ol> <li>The team size is 2.</li> <li>Time allotted is 60-minutes.</li> <li>All questions carry equal marks. Each correct answer rewards you with 4 marks while each wrong answer costs you 1 mark.</li> <li>The answers that you wish to mark must be indicated with a tick symbol over the answer option. Questions answered with incoherent marking will not be considered.</li> <li>In case of more than one possible solutions, only the most appropriate option is chosen as the answer.</li> <li>Use of any electronic devices such as calculators, mobile phones etc. is strictly prohibited. Any attempt at malpractice will lead to an immediate disqualification of the team.</li> </ol>", "contact": "<div><p><b>Milan Xavier</b></p><p>Event Coordinator</p>+91 9947674225</p></div><div><p><b>Greena George</b></p><p>Event Coordinator</p><p>+91 9061453056</p></div>", "contactInfo": [{"name": "Milan Xavier", "designation": "Event Coordinator", "phone": "+91 9947674225"}, {"name": "Greena George", "designation": "Event Coordinator", "phone": "+91 9061453056"}], "prize": "9k", "registration": "No Additional Fee", "department": "Computer Science", "category": "Offline", "date": "03rd - 4th Nov", "time": "3:00 PM", "venue": "Govt. Model Engineering College", "img": "http://excelmec.org/static/images/lord-of-code.png", "color": "grey", "id": 33}, {"message": "No competition found with the specified `id`."}, {"message": "No competition found with the specified `id`."}, {"message": "No competition found with the specified `id`."}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Creative Event", "codename": "creative-event", "about": "<p>Prepare to think outside the box to come up with the best products making the most impact!<br>Excel 2018 introduces the <b>Creative Event</b>!<br>This is a chance to apply your ideas to design something unique and artistic using software that befits it.<br><i>May the best creations shine bright amongst the rest!</i></p>", "format": "<b>Preliminary Round:</b> <ul> <li>The participants will be given half an hour to create a simple UI on a given topic.</li>  <li>They will be judged solely on the basis of UI aesthetics and technology used.</li> <li>10 teams selected in this round will move on to the finals.</li> </ul> <br><b>Final Round:</b> <ul> <li>The participants will be given a topic (brand/product/cause) on which they will have to design a logo and a well-designed website for the same. </li> <li>They can use any build system of their choice. Using boilerplate UI is discouraged. </li> <li>They will be judged on the basis of the originality, graphics, UI and build system knowledge.</li> </ul>", "rules": "<b>Rules and Regulations</b> <ol> <li>Participants are to bring their own laptops, chargers and any other peripherals. </li> <li>Teams are only allowed to use PS/AI/GIMP/Inkscape for design purposes.</li> <li>Plagiarism and malpractice will result in disqualification.</li> <li>Participants are expected to report for the competition on time and no compensatory extra time will be awarded for coming late.</li> <li>Rules are subject to change at any point in time.</li> </ol>", "contact": "<div><p><b>George Thomas</b></p><p>Event Coordinator</p>+91 95679 90010</p></div><div><p><b>Prince Mathew</b></p><p>Event Coordinator</p><p>+91 94972 47908</p></div>", "contactInfo": [{"name": "George Thomas", "designation": "Event Coordinator", "phone": "+91 95679 90010"}, {"name": "Prince Mathew", "designation": "Event Coordinator", "phone": "+91 94972 47908"}], "prize": "8k", "registration": "No Additional Fee", "department": "Computer Science", "category": "Offline", "date": "02nd Nov", "time": "9:45 AM", "venue": "CC2, Govt. Model Engineering College", "img": "https://excelmec.org/static/uploads/images/creative-event.png", "color": "coral", "id": 37}, {"message": "No competition found with the specified `id`."}, {"message": "No competition found with the specified `id`."}, {"contributors": [{"username": "pallavi", "email": "pallavivg98@gmail.com", "lang": "en_US", "template": "default", "id_ref": "1", "provider": "local", "id": 3, "createdAt": "2018-10-16T14:17:34.761Z", "updatedAt": "2018-10-16T14:31:29.337Z"}], "active": true, "name": "Q.E.D", "codename": "qed", "about": "<p>Its another day in the detectives office and you get a phone call from the local constable.<br>You've been assigned a case which involves a string of serial murders across the MEC campus.<br>There has been 7 crime scenes where the culprit was known to have visited.<br>It's up to you and your team of Dr Watsons to solve the mystery and find the culprit by investigating these crime scenes.</p>  <p>Come and join Q.E.D , <b>EXCEL's biggest AR interactive event</b> that will test your investigative skills.</p>", "format": "<ol> <li>Teams have to register to participate in the event.</li> <li>Atleast one member of the team needs to have an Android Phone to be able to participate.</li> <li>Android phones minimum requirements: <ul> <li>Quad Core CPU</li> <li>1-2GB RAM</li> <li>Version:6(Marshmellow) or higher</li> <li>Gyroscope Sensors</li> </ul></li> <li>The AR app apk will be provided during registration along with a suspect list pdf and Crime scene description pdf.</li> <li> The AR app can scan objects or images and project an Augmented Image or model which reveals a clue.</li> <li>There are a number of crime scenes scattered across the campus.The crime scenes will be marked.</li> <li>Crime scene works on a first come first serve basis.Each team is alloted 5 minutes for one scene.</li> <li>Each crime scene will have clues leading to the final suspect.</li> <li>Certain objects when scanned will provide an AR message through the app.</li> <li>First team to find the correct suspect will win the event.</li> <li>Each team gets only one chance to reveal the suspect they find along with proper explanation of their deduction.</li> <li>Rules can be subject to changes during or before the course of the event.</li> </ol>", "rules": "<b>Rules and Regulations</b> <ol> <li>Admin's decisions are final and should not be questioned.</li> <li>Malpractices or any sort of practices which grant advantages over other players, like accessing restricted files/sharing answers etc are discouraged and can result in disqualification under the final decision of the admin.</li> <li>Any user other than the admin found sharing answers or clues will be immediately banned from the hunt.</li> <li>Teams should register at the start of the event and meet the necessary requirements to participate in the event.</li> <li>Teams can also register after the start of the event but with a time disadvantage.</li> <li>Teams can have up to maximum 3 members.</li> <li>Crime Scenes that are set up across the campus can not be entered without registration.</li> <li>Objects at the crime scenes should not be tampered with or damaged. Any particiant found damaging the objects will be penalised or disqualified.</li> <li>Participants are supposed to refer to the suspect list before giving the final answer.</li> <li>One Scene is supposed to have only one team at a time, and if a queue is present each team is alloted 5 minutes to complete and other teams are encouraged to go to other scenes.</li> </ol>", "prize": "2k", "department": "Non-Tech", "category": "Offline", "date": "03rd Nov", "venue": "Govt. Model Engineering College, Thrikkakara", "contact": "<div><p><b>Rawn Riju</b></p><p>Event Coordinator</p>+91 97445 84954</p></div><div><p><b>Vaishnav Ullas</b></p><p>Event Coordinator</p><p>+91 96338 47621</p></div>", "contactInfo": [{"name": "Rawn Riju", "designation": "Event Coordinator", "phone": "+91 97445 84954"}, {"name": "Vaishnav Ullas", "designation": "Event Coordinator", "phone": "+91 96338 47621"}], "registration": "No Additional Fee", "img": "https://excelmec.org/static/uploads/images/QEDlogo2.png", "color": "red", "id": 40, "time": "2:00 PM"}]